[
    { "name": "Grave Witch",
      "series": "Alex Craft",
      "imagePath": "../../assets/Images/GraveWitch.jpg",
      "description": [
          "Grave witch Alex Craft can speak to the dead, but that doesn’t mean she likes what they have to say . . . ",
          "As a private investigator and consultant for the police, Alex Craft has seen a lot of dark magic. But even though she’s on good terms with Death himself—who happens to look fantastic in a pair of jeans—nothing has prepared her for her latest case. Alex is investigating a high profile murder when she’s attacked by the ‘shade’ she’s raising, which should be impossible. To top off her day, someone makes a serious attempt on her life, but Death saves her. Guess he likes having her around . . .",
          "To solve this case Alex will have to team up with tough homicide detective Falin Andrews. Falin seems to be hiding something—though it’s certainly not his dislike of Alex—but Alex knows she needs his help to navigate the tangled webs of mortal and paranormal politics, and to track down a killer wielding a magic so malevolent, it may cost Alex her life . . . and her soul."
      ],
      "firstChapter": "http://kalayna.com/GWExcerpt.html"
    },
    {
      "name": "Grave Dance",
      "series": "Alex Craft",
      "imagePath": "../../assets/Images/GraveDancethumb.jpg",
      "description": [
          "Whoever said dead men tell no tales obviously never met Alex Craft.",
          "After a month spent recovering from a vicious fight with a sorcerer, grave witch Alex Craft is ready to get back to solving murders by raising the dead. With her love life in turmoil thanks to the disappearance of Fae Investigation Bureau agent Falin Andrews and a shocking “L” word confession from Death himself, Alex is eager for the distractions of work. But her new case turns out to be a deadly challenge.",
          "The police hire Alex to consult on a particularly strange investigation in the nature preserve south of Nekros City. The strange part: There are no corpses, only fragments of them. A serial killer is potentially on the loose, and Alex has no way to raise a shade without a body, so she’ll have to rely on the magic of others to find leads. But as she begins investigating, a creature born of the darkest magic comes after her. Someone very powerful wants to make sure the only thing she finds is a dead end—her own."
      ],
      "firstChapter": "http://kalayna.com/excerptGD.html"
    },
    {
      "name": "Grave Memory",
      "series": "Alex Craft",
      "imagePath": "../../assets/Images/GraveMemory.jpg",
      "description": [
        "When the dead need to talk, Alex Craft is always ready to listen…",
        "As a Grave Witch, Alex solves murders by raising the dead—an ability that comes at a cost, and after her last few cases, that cost is compounding. But her magic isn’t the only thing causing havoc in her life. While she’s always been on friendly terms with Death himself, things have recently become a whole lot more close and personal. Then there’s her sometime partner, agent Falin Andrews, who is under the glamour of the Winter Queen. To top everything off, her best friend has been forever changed by her time spent captive in Faerie.",
        "But the personal takes a backseat to the professional when a mysterious suicide occurs in Nekros City and Alex is hired to investigate. The shade she raises has no memory of the days leading up to his brutal ending, so despite the very public apparent suicide, this is murder. But what kind of magic can overcome the human will to survive? And why does the shade lack the memory of his death? Searching for the answer might mean Alex won’t have a life to remember at all…"
      ],
      "firstChapter": "http://kalayna.com/excerptGM.html"
    },
    {
      "name": "Grave Vision",
      "series": "Alex Craft",
      "imagePath": "../../assets/Images/GraveVisions.jpg",
      "description": [
        "If a girl can't trust the dead, who can she trust?",
        "If you want to hear voices from the dead in Nekros City, you call Alex Craft. She’s a grave witch with reasonable rates and extraordinary powers who specializes in revealing the secrets of the dead. But now she’s the one fighting to keep her own secret. She’s not human—and her newly discovered heritage is causing havoc for her both in the human realm and in Faerie.",
        "But her status as an unaffiliated fae also makes her an ideal candidate to investigate a new street drug that has surfaced in several of the spaces between the human and fae worlds. This glamour-infused drug causes hallucinations that turn real—at least for a while and often with deadly consequences. Searching for the source of this drug—and its purpose—lands Alex front and center in the conflict brewing in Faerie, and she must find answers before she’s dragged so deep that she loses her freedom."
      ],
      "firstChapter": "http://kalayna.com/excerptGV.html"
    },
    {
      "name": "Grave Ransom",
      "series": "Alex Craft",
      "imagePath": "../../assets/Images/GraveRansom.jpg",
      "description":  [
        "Grave witch Alex Craft is no stranger to the dead talking. She raises shades, works with ghosts, and is dating Death himself. But the dead walking? That’s not supposed to happen. And yet reanimated corpses are committing crimes across Nekros City.",
        "Alex’s investigation leads her deep into a web of sinister magic. When Briar Darque of the Magical Crimes Investigation Bureau gets involved, Alex finds herself with an unexpected ally of sorts. But as the dead continue to rise and wreak havoc on the living, can she get to the soul of the matter in time?"
      ],
      "firstChapter": "http://kalayna.com/excerptGR.html"
    },
    {
      "name": "Once Bitten",
      "Series": "Heaven",
      "imagePath": "../../assets/Images/OnceBitten.jpg",
      "description":  [
        "For the past five years, Kita Nekai has faded into the background of the human world, but when a rogue shifter begins littering the city of Haven with bodies, Kita's illegal status lands her on the suspect list. During a confrontation with hunters that she can't win, rescue arrives in the form of the mysterious Nathanial Deaton. Kita soon wishes it hadn't when his method of saving her leaves her undead. With only three nights to prove her innocence and a new liquid diet to worry about, Kita doesn't want to deal with her infuriating rescuer or the ghost from her past who is determined to drag her back home. But, she needs help if she's going to stand any chance of survival."
      ],
      "firstChapter": "http://kalayna.com/OBexcerpt.html"
    },
    {
      "name": "Twice Dead",
      "Series": "Heaven",
      "imagePath": "../../assets/Images/TwiceDead.jpg",
      "description":  [
        "Kita is adjusting to her new liquid diet--an adjustment she rather resents. Not that everything was chocolate and sunshine before (though both were possible before the sexy but infuriating Nathanial sank his fangs in her business). Kita's ability to shape shift into a kitten when her peers shifted into lions and tigers complicated her life, to say the least, but getting stuck in one form--that of a human shaped tick, a.k.a. a vampire--sucks, literally. Her adjustment period is violently interrupted when she discovers a headless corpse during a party for a visiting vampire council. But, the headless dancer won't be the only corpse she encounters.",
        "Kita's involvement draws the attention of the Collector, an ancient vampire with an inclination to acquire two things: power and oddities. As a pureblood shifter turned vampire, Kita ranks high on the collectability list--not a safe place for anyone who values her freedom, and Kita is not the only one on the list. But with the body count rising, there is more at stake than freedom. A killer is slithering through the underbelly of Haven's vampire community, and with the supernaturals dealing in unnamed favors, it's a bad time to be a kitten who can't slip her skin."
      ],
      "firstChapter": "http://kalayna.com/tdexcerpt.html"
    },
    {
      "name": "Third Blood",
      "Series": "Heaven",
      "imagePath": "../../assets/Images/Thirdblood.png",
      "description":  [
        "Going home after five years is difficult. It's harder still if you've changed species in the interim.",
        "Kita Nekai, once the smallest shifter in Firth but now the newest vampire in the city of Haven, has no intention of returning home or informing her father and clan what she's become. Not that she has a choice. When the mage who holds her death certificate in his hands demands Kita return to Firth as his errand runner, she has to comply. Of course, there is no leaving her sire, Nathanial, behind. Which means introducing daddy dearest to the man—well, vampire—she may be falling for and confessing that she's lost the ability to shift. Talk about awkward.",
        "Her homecoming goes from bad to worse when an attempt is made on her life, and Kita finds herself facing an unknown threat in a hostile world she never fit into in the first place. Can she survive long enough to complete the judge's task, stand trial before the elders for the rogues she created while on the run, and help defend her father's territory from an encroaching band of misfit shifters? Or is this cat down to her last life?"
      ]
    }

]