[
  {
    "name": "Grave Witch",
    "firstChapter": [
      "The first time I encountered Death, I hurled my mother's medical chart at him. As far as impressions went, I blew it, but I was five at the time, so he eventually forgave me. Some days I wished he hadn't—particularly when we crossed paths on the job.\n",
      "\"Ms. Craft, this is beyond unacceptable.\" Henry Baker accented the statement with a plump fist slicing the air before his face. Behind him loomed Death.\n",
      "Eighteen years of practice kept my gaze off the jean-clad soul collector and on my client, whose face darkened from cherry red to bruised purple. I fingered the spray of funeral lilies at my side, dreading the direction this conversation was taking.\n",
      "\"Our contract stipulated I raise the shade. I did.\"\n",
      "Baker swatted aside my protest. \"You promised me results.\"\n",
      "\"I said you could ask your questions.\" I leaned against his father’s coffin. It wasn't exactly respectful, but I'd just shoved the senior Baker’s shade back into his body two hours before his funeral. Respect had nothing to do with this job. But hey, a paycheck is a paycheck.\n",
      "Baker turned on his heel and stomped across the aisle. I waited. I knew what was coming. Baker was a fortune hunter—a failed one at that—and I'd worked with his like before.\n",
      "Death followed in Baker's wake. He exaggerated each heavy step, mocking the chubby man's jerky movements. All the while, a grin clung to his lips, his dark eyes never leaving me.\n",
      "This had better be a social visit. I met his gaze, pleading, warning—I didn't care which—him to leave my client alone. He flashed a row of perfectly straight teeth, which didn't tell me anything.\n",
      "Baker continued to pace.\n",
      "Well, best get this part over quickly. \"According to our contract, you can pay by cash, check, or money order. Will you need a receipt?\"\n",
      "Baker jerked to a stop. His eyes bulged, the skin hanging from his cheeks shaking. \"I refuse to pay for this.\"\n",
      "Here we go. I shoved away from the casket. \"Listen, mister, you wanted a shade raised. I raised a shade. If dear old dad didn't say what you wanted, well, that's your problem, not mine. We have a binding agreement and if—\"\n",
      "He dropped his fist, and his eyes flew wide, startled.\n",
      "That was simpler than I expected. I let out a breath to purge the rant from my tongue and pasted on my professional smile. \"Now, will you need a receipt?\"\n",
      "Baker gripped his chest and wheezed. Once. Twice. Then in slow motion, his neck twisted, his gaze moving over his shoulder. The amusement melted from Death's face.\n",
      "Oh crap.\n",
      "Angel of Death, Soul Collector, Grim Reaper—whatever you called him, most people saw him only once. He strolled forward, and Baker stumbled back a step.\n",
      "Crap. I jumped from the casket platform. \"Don't.\"\n",
      "Too late.\n",
      "Death reached into Baker’s pudgy torso, and the color leached from my client’s face. He swayed. Death stepped back, and Baker blinked once more before crumpling.\n",
      "A scream rang from the corner of the room, followed by the clatter of chairs. The funeral director sprinted up the aisle, Baker’s wife and teenaged son behind him. His assistant, her eyes already glistening, fumbled a phone from her waistband.\n",
      "“9-1-1,” she said as Baker the third—and last remaining—pumped his father’s chest. Poor kid.\n",
      "I crept away from the commotion. Giving the family space was all I could really do. Death had already collected the soul—there wasn’t any way to revive Henry Baker now. Not that I was going to be the one to tell his family that fact.\n",
      "Death leaned against the far wall, his muscular arms crossed over his wide chest. He smiled, all devilish innocence as his dark hair fell forward around his chin. I glared at him and scooped my purse from the floor. I couldn’t fault him for collecting Baker’s soul—after all, he had a job to do—but . . .\n",
      "“You could have waited until I got paid.”\n",
      "He shrugged. “Didn’t seem like he planned to pay you.”\n",
      "True. Maybe. The frantic huddle around Baker’s body churned. This is so going to be bad for business.\n",
      "I shoved my hand in my purse and fished along the bottom. I ignored the billfold—I knew it was empty. Under the tube of chalk for casting my circle, a ceramic ritual knife, my cell phone, and my license, I discovered three pennies, a dime, a crumpled foil wrapper, and a paper clip.\n",
      "Death glanced at the treasure spread over my palm. “Planning on buying a gumball?”\n",
      "“Bus fare for the trip home.”\n",
      "We both frowned at my palm. Thirteen cents wasn’t going to cut it. But an emergency vet bill had wiped out everything I had. Until a job actually paid out, I was broke.\n",
      "“Aren’t you working the Amanda Holliday trial with the DA?” Death asked.\n",
      "I dumped the change into my purse. “The shade won’t take the stand until tomorrow, and then I have to wait for the City, or whoever, to cut the check.”\n",
      "I was giving the prosecution their star witness, because for once, being dead wasn’t going to stop the victim from accusing her murderer. So far the headlines were mixed on whether I was the “voice of the silenced” or the “corrupter of the dead,” but one thing was certain: it was big news.\n",
      "More importantly, as long as the defense didn’t rip me apart, I might end up on Nekros City’s permanent payroll instead being just an occasional consultant for the police. Then I wouldn’t have to deal with fortune hunters like Henry Baker.\n",
      "“You staying for this?” Death nodded to Baker’s body.\n",
      "Baker’s son still pumped the dead man’s chest, fighting to reclaim his father, but the new widow had abandoned hope. She clung to the funeral director, who steered her toward the seats in the front row. I didn’t see the assistant.\n",
      "“Yeah, I’m staying. I wouldn’t want to be accused of fleeing the scene.”\n",
      "Death shrugged, his black-clad shoulders lifting slightly. As they dropped again he vanished. I hated when he did that. One minute here; the next gone. He’d turn up again. He always did.\n",
      "In my purse, Queen's Freddie Mercury belted out the line “We Will Rock You” and I cringed. The widow’s gaze snapped to me, her mascara-ringed eyes hard.\n",
      "Maybe not the best ringtone for the current situation.\n",
      "Turning away, I dug my phone out and glanced at the display. I didn’t know the number. Let this be a job, not a bill collector. I flipped it open. “You’ve reached Tongues for the Dead. This is Alex Craft.”\n",
      "“Alexis?”\n",
      "I pulled the phone from my ear and frowned at the display. I still didn’t know the number. Who would call me—\n",
      "“Alexis,” the female voice asked again. “Are you there? I need your help.”\n",
      "“Casey?”\n",
      "Her affirmative was a choked sob. My sister never called me. What was I supposed to say to her?\n",
      "“What do you need?” I asked, and then grimaced. The question had sounded a lot more sensitive in my head.\n",
      "“Have you seen the paper?”\n",
      "“Not today.”\n",
      "Casey’s voice caught in her throat, and it took her two tries to whisper, “They found Teddy.”\n",
      "Teddy?\n",
      "The angry click of high heels rang across the room, heading in my direction. Uh-oh. I covered the mouth of the phone with my palm as I turned. The new widow was a head shorter than me, but twice as wide, and right now it looked as if that extra weight was pure mean anger.\n",
      "“You did this.” Her finger drilled into my arm.\n",
      "Oh good—she’s found someone to blame. Me.\n",
      "Clearing my throat, I ducked my head and said, “I’m very sorry for your loss.”\n",
      "She continued as though she hadn’t heard me. “I told him not to hire a witch. I told him.” Her voice turned shrill, and she collapsed into the wall. “I told him.”\n",
      "I backed away, allowing the director to ease Mrs. Baker to a seat. In the distance, sirens hurtled down the street.\n",
      "The phone squawked in my hand. “Alexis, are you there?”\n",
      "“Yes, I’m here. You said something about a Teddy.”\n",
      "The line was silent long enough that I wondered if she’d hung up; then she said, “Theodore Coleman? Surely you’ve heard of him. The police found his body last night. I need to know who shot him and where he’s been these past two weeks.”\n",
      "I almost dropped the phone. She had to be kidding. Vice presidential hopeful Governor Theodore Coleman? A restaurant’s surveillance camera had caught the shooting, but then Coleman had disappeared. If his body had been found, it would be a big case. Considering Coleman’s political affiliation with the Humans First Party—and the party’s open disdain for witches—my interference wouldn’t be appreciated. “Casey, I don’t think—”\n",
      "“Please.” Her voice broke again. “The police think Daddy is involved. They’ve been by the house several times already.”\n",
      "I rolled my eyes. The police could look, but nothing stuck to Lieutenant Governor George Caine. Well, I guess he’s actually the governor now. Our father had deep pockets and a wide reach. After all, he’d buried my name change from Caine to Craft—and the fact his daughter was a practicing witch—so deep the media hadn’t managed to dig it up during his campaign. Besides, I’d barely spoken to him since I turned eighteen. I saw him more in the paper and on TV campaigning for the Humans First Party than in person. Why would I get involved now? “Casey, this really isn’t—”\n",
      "“Please. This is what you do—right? You’re some sort of magic eye?”\n",
      "My jaw clenched. “Magic eye” was slang for a witch with a private detective license who did very little “real\" investigative work. While I might not trail leads through dark alleys, and my investigations typically went only as far as questioning the deceased, I did find answers for my clients.\n",
      "I took a deep breath and forced a smile to spread across my face, to seep into my voice. “I’m sorry. I can’t help you.” The words came out sickly sweet, but I didn’t talk to my sister enough for her to recognize the tone. “I can’t get involved in an ongoing police investigation.”\n",
      "“I can pay you.”\n",
      "I frowned at the phone. Last I’d heard, Casey had bought into the antiwitch position of the Humans First Party. If she was willing to actually hire me, she must be truly worried.\n",
      "“Please, Alexis. Please. I need your help.”\n",
      "“Okay.” Damn. I was working for my little sister, but I’d look into the case. See what I could find. With a sigh, I rattled off my standard legal spiel, quoted my rates, and told Casey to expect an e-mailed copy of my contract later that afternoon. As I spoke, the sirens hurtled closer, and I shouldered my purse with its thirteen cents, gum wrapper, and paperclip.\n",
      "“When will you talk to the ghost?”\n",
      "Ghost? I suppressed a groan but didn’t bother correcting her. After all these years, if she hadn’t grasped the fact that ghosts were cognizant, wandering souls but shades were just memories, she clearly hadn’t been paying me any attention. Instead I said, “If you want to be present to question Coleman’s shade, we’ll have to wait until the police release the body and it’s in the ground. If you want faster answers, I might be able to question him at the morgue, but you can’t attend the ritual.”\n",
      "The line was silent except for soft ragged breaths on the other side. I gave her a moment to think as the sound of sirens drew closer.\n",
      "“The morgue.” Casey’s voice dropped in pitch. “How soon will you get back to me?”\n",
      "Getting access to a high-profile body in an open case would be difficult, but I’d built connections during my three years of running Tongues for the Dead. “I have a friend at the station. I’ll give him a call, but I can’t make any promises. I’ll contact you tonight if I get access to the morgue today. Otherwise, expect me to check in tomorrow afternoon.”\n",
      "Wrapping up the call, I saved Casey’s number and moved to get the door for the paramedics. The ambulance pulled to a stop, and a black-and-white cop car jetted to the curb behind it. Good, maybe the cops could give me a ride. The chill of Mrs. Baker’s glare crawled across my shoulders. Preferably I’d catch a ride in the front seat of the cop car—not in the back of the wagon, under arrest.\n",
      "As the paramedics rushed up the stairs I scrolled through the contacts on my phone until I reached the number for my friendly neighborhood homicide detective. A gruff voice answered on the third ring.\n",
      "“Hey, John,” I said as I stepped clear of the emergency workers. “I need a favor.”\n",
      "***\t\n",
      "The doors to the Nekros City Central Precinct slid open, allowing the sixty-degree air inside to escape. The sweat clinging to my skin from the short walk across the blacktop chilled instantly. Six p.m. and the temperature hadn’t dropped under a hundred yet. The south in the summer—you had to love it.\n",
      "I swiped the escaped blond curls plastered to my face back into a messy ponytail and turned to wave to the two officers who’d given me a ride. I hadn’t been arrested in connection to Baker’s death, but there had been some tense moments back at the funeral parlor. Luckily, when Tamara, the medical examiner, arrived, she’d been able to confirm the absence of magical influence on the body during her initial examination, which freed me to follow up with John at the morgue. My favorite homicide detective had agreed to get me in to see Coleman’s body, but only if I did a favor for him in return. In this case, “a favor” translated into raising an extra shade.\n",
      "The cops turned out of the parking lot, and I stepped between the automatic doors and headed for the security check. I dug my ceremonial knife and wallet from my purse before dropping the bag on the conveyer belt. As my purse disappeared under the x-ray machine I put the knife in the basket the guard gave me. Then I handed the basket and my wallet—open to display my PI license and my magical certification issued by the Organization for Magically Inclined Humans—OMIH for short—to the guard. He glanced over my credentials before confiscating the knife, which I’d pretty much expected. Turning, I walked through the metal detector. No issue there, but the spell detector beeped loudly as I stepped through.\n",
      "The security guard motioned me to stop and grabbed a spellchecker wand. “Hands out, palms up.”\n",
      "I did as he instructed, tapping my toe inside my boot as he waved the wand with its rudimentary detection spell over me. The glass bead on the tip glowed green as it moved over my right hand and the obsidian ring I stored raw magic in. Green meant magic, but not an active spell. On my other wrist, the bead glowed yellow as it traced over my shield bracelet—active magic, but not a malicious charm. Malicious spells, even inactive ones, made the bead glow red. The bead didn’t turn red.\n",
      "With a nod, the guard motioned for me to drop my hands as he placed the wand back in its stand. I grabbed my purse, my wallet, and the ticket I’d need to reclaim my knife when I left. Then I made my way to the elevators.\n",
      "Central Precinct was an austere but multipurpose building situated in the middle of downtown Nekros in what people tended to refer to as the judicial block because of the proximity of the statehouse, the state supreme court, and Central Precinct. Though it was not overly apparent from the back of the building where I’d entered, the main floor housed Nekros City’s central police station as well as the undersheriff’s offices. Upper levels of the building boasted the central crime labs and the district attorney’s suite, but I wasn’t headed up. The basement level contained the medical examiner’s administrative offices and her place of power—the morgue.\n",
      "John Matthews, the best homicide detective Nekros City could ever ask for—at least, in my opinion, but then he was also a good friend—waited outside the main morgue door. His grizzly bear–sized form looked uncomfortable hunched over in the orange plastic chair, but his chin touched his chest, his eyes closed. Apparently not too uncomfortable for a nap. Wrinkles creased deeper wrinkles in his brown jacket, so he must have worked though the night—Maria would have never let him leave the house so disheveled.\n",
      "“You all right there, John?” I asked as I clipped my visitor badge to the strap of my tank top. I didn’t yell—at least, not quite. Still, my voice reverberated off the too-close walls, the echo making me wince.\n",
      "John’s head jerked up, and the report in his lap hit the floor, pages scattering. “Alex? Geez, don’t do that.”\n",
      "Okay, in hindsight, maybe I should have woken him more quietly.\n",
      "I knelt, gathering pages. Several photos had also scattered, and I grabbed one that floated under the chair. A pale shoulder lay in sharp contrast to the black garbage bags dominating the picture. A limp hand had escaped the dark plastic; the long wrist was delicate, feminine.\n",
      "I handed the photo and pages to John. “Body dump?”\n",
      "He nodded, rubbing his palms against the dark shadows under his eyes. “Third girl this month with the same MO.”\n",
      "Third? The cops must have been keeping this case very quiet for the press not to have picked up on three connected murders. I itched to get a better look at the case file—morbid curiosity might have been a personality flaw, but I talked to the dead for a living. I didn’t press John—at least, not yet. He’d tell me as much as he was comfortable telling. I nodded at the file. “She the extra I’m raising?”\n",
      "He nodded. “Yeah. My black-bag special.”\n",
      "As in a Jane Doe. “I’ll take a guess that you have no leads from the first two bodies?”\n",
      "“Wouldn’t be a fair trade if I did.” His tone was light, but his shoulders slumped forward. “You got a pen?”\n",
      "I pulled out the pen I’d pilfered from the desk jockey who’d signed me in to the basement level. John thumbed through the pages in his lap, separating documents from the case file. I signed the normal assortment of nondisclosure agreements and official paperwork. My standard rate was crossed out; the words “pro bono” were scrawled in red pen. I bit my lip as I initialed the change. Free hurt, but John was doing me a huge favor by letting me see Coleman’s body. Having an official case I was working on legitimized my trip to the morgue. Didn’t make the big zero feel any better, though.\n",
      "I handed the signed documents to John, and he tucked them away before pushing open the morgue door. The fluorescents buzzed over our heads, mixing with the scrape of our footsteps on the linoleum floor. Trays of sterile equipment surrounded the two unoccupied autopsy stations on either side of the room. In the back waited the cold room—or corpserator, as I called it. Beside the cold room, yellow light filtered from the window looking into the medical examiner’s office.\n",
      "The office door opened, and a shaggy-haired intern in a white coat emerged. “Detective Matthews, Miss Craft, can I help you with something?” His eyes flickered from John to me.\n",
      "Miss Craft? I frowned at him. Tommy Stewart had spent the past year as the medical examiner’s intern, and he hadn’t called me by my last name since his second week. Granted, we’d gone out for drinks a month ago, and well, one thing had led to another, but it hadn’t been anything serious. Or at least, I hadn’t thought so.\n",
      "“Tommy,” John said, “how about you take a cigarette break.”\n",
      "It wasn’t a question.\n",
      "Tommy shoved his hands in his pockets and rolled his shoulders back. “There a body you need?”\n",
      "“I got it covered.” John waited. “Now, how about that break . . . ?”\n",
      "Tommy shook his head. “Detective Andrews said—”\n",
      "John cut him off. “I’ll take care of Andrews.”\n",
      "Tommy’s mouth twisted, his eyes pinching, but all he said was “Right, a cigarette break.”\n",
      "He jerked into motion but paused at the door. His gaze landed on me, the look hard. Boy, do I know how to kill a friendship. I sighed as the door swished closed behind him.\n",
      "“Who’s Detective Andrews?” I asked as John disappeared into the freezer.\n",
      "He didn’t even glance back. “Don’t worry about it.”\n",
      "I rocked on my heels as I waited. Several white-sheet–topped gurneys were visible beyond the thick doorframe—busy week at the morgue. A translucent figure walked among the bodies, muttering to himself. The baggy jeans and flannel shirt he wore were colorless, shimmering with each of his steps. If I had dropped my shields, I could have made out the color of his hair and heard what he was saying, but I wasn’t that curious. Ghosts, at least true wandering souls, were rare, but as a whole they were an obnoxious bunch. After all, it took a severely stubborn personality to withstand Death’s attempt to collect a soul. Unfortunately, most ghosts I’d encountered hadn’t been pleased with their success. They were just pissed that their struggles hadn’t kept them alive.\n",
      "I must have made a noise, because the ghost looked up and saw me watching. He pushed a pair of shimmering glasses higher up his nose, then flipped me off. Jerk. I returned the rude gesture, and his mouth fell open. I was no lip reader, but the slow question “You can see me?” was obvious enough that I nodded.\n",
      "His next words weren’t nearly as easy to decipher as his lips dashed into motion. His hands flitted through the air, accenting his silent speech with extravagant motions. Great—an excitable ghost. How long has he been dead? Most ghosts took a while to realize that no one could see them. Well, no one but grave witches like me.\n",
      "I might have dropped my shields, just a smidgen, to hear what the ghost was saying, but John chose that moment to reemerge. Actually, the gurney he was pushing emerged first, sliding through the ghost’s shimmering form. The ghost’s mouth snapped closed as he glanced down at the sheet-topped gurney passing through his hips.\n",
      "I looked away before John stepped through the ghost as well. It was disturbing to watch things like that.\n",
      "“Which is this?” I asked, tossing a nod at the lumpy form in the center of the gurney.\n",
      "“How about you tell me.” John stopped in the center of the room, and his mustache twitched as he smiled. “So, you’re going to make it to dinner tonight?”\n",
      "Oh yeah, it’s Tuesday. I nodded. “Can you give me a ride?”\n",
      "“Course.” He pushed out a second gurney, this one with a body still in a black transport bag. The ghost was nowhere in sight. John parked the gurney beside the first. “Maria is making pork chops. A couple of the boys from the station will be joining us.”\n",
      "My stomach gurgled, and I squeezed my abs, trying to silence it. Way to go, stomach; let everyone know I skipped breakfast. And lunch.\n",
      "I set my purse by my feet and dug out the black lipstick tube I carried my oil chalk in. Crouching, I pressed the waxy chalk to the linoleum floor. I dragged it, duckwalking, around the two gurneys.\n",
      "As I drew my circle John adjusted the digital equipment. The camera was meant for recording autopsies, but John borrowed it whenever I raised shades for a case.\n",
      "“Heard you might be a murder suspect.”\n",
      "I dropped the chalk. “You what? No, I—” The tube rolled toward the drain in the floor, and I scrambled after it. “I mean the widow thought I . . . But Tamara cleared me.” John’s mustache twitched so fiercely with his attempt not to smile, it nearly walked off his face. I frowned, and a deep-bellied laugh erupted from him.\n",
      "It wasn’t funny.\n",
      "Still, he had an infectious laugh. I found myself grinning as I finished my circle.\n",
      "“Seriously though,” I said, capping my chalk. “If Tamara hadn’t been the medical examiner at the scene, I could be in holding right now. Waiting for the autopsy.” Being held under suspicion of death magic was not something I wanted. Nulls already had enough trouble understanding the difference between death magic and grave magic—my unfortunate specialty. Luckily, as well as being the lead ME, Tamara was a certified sensitive. She could locate a spell quicker and more accurately than any spellchecker charm, and unlike a charm, she could usually discern the purpose of the spell. The only magic she’d been able to sense at the scene had been the ritual I’d used to raise the shade and charms to keep the flowers fresh. No spell had been involved in Baker’s death.\n",
      "With my circle complete, I stood. Recapping my chalk, I tucked it away.\n",
      "John flipped a switch, and the camera turned on. “Ready?”\n",
      "I nodded, closed my eyes, and cleared my mind. The obsidian ring on my right hand throbbed with the raw energy I’d stored. I mentally tapped into it, drawing out a spindly string of magic. There wasn’t much. I hadn’t had time to recharge the ring after the ritual for Henry Baker, but there was enough. I channeled the energy into the wax circle, and it sprang to life, buzzing with pale blue power behind my eyelids.\n",
      "Now for the fun part.\n",
      "Releasing my connection to the magic stored in the obsidian ring, I unclasped the thin silver charm bracelet on my wrist and shoved it in my pocket. The extra defenses the charms gave me vanished. The chill of the grave pressed against my mental shields like icy water lapping at the edge of my consciousness. I drew in a deep breath and sank deeper into a trance. The grave essence lifting from the corpses within my circle persisted, thundering against my mind. Beckoning. Taunting. Demanding.\n",
      "I dropped my shields.\n",
      "A racking wind rushed through me. The clammy touch of the grave slid against my skin, beneath my flesh.\n",
      "I opened my eyes.\n",
      "My vision had narrowed, leaving the world covered in a patina of gray. Flakes of rust covered the stainless steel gurneys on either side of me. The threadbare and tattered linen sheet covering the body on the gurney to my left rippled in the breeze blowing through me. The linoleum floor under my boots had worn away, and the cement beneath it crumbled. Outside the circle, John’s wrinkled jacket was pocked with holes, but he was filled with light, his soul a dazzling shimmer of pale yellow. I looked away. The wind picked up, filling my ears with its roar and blocking out any other sound. The chill buffeted me, clawing under my skin, into my blood.\n",
      "It hurt.\n",
      "I was alive. A being of warmth and breath, not of cold and stillness. Not of death. My life force burned against the chill, warring against the grave essence wiggling into the center of my being. Sweat beaded on my skin even as I shivered.\n",
      "I needed reprieve.\n",
      "The soulless husk in the body bag called to me. I didn’t need to guide the power. I stopped fighting it, and my living heat spilled into the waiting corpse. As my heat fled, the chill of the grave sank comfortably into my limbs. The roar of wind stilled. I blinked. I could feel only one body within the circle—the female in the black bag.\n",
      "Strange.\n",
      "I mentally reached for her, my innate magic following the trail my heat had burned. Even filled with my life force, the shade my mind touched was weak, tattered. How could a shade who’d never been raised fade so quickly?\n",
      "My magic trailed along large cuts in the feeble shade. The deep, gaping incisions nearly shredded her to pieces. I’d never felt anything like it.\n",
      "I poured magic into the corpse, letting my power fill the holes in the broken shade. She still felt frail—barely remembered. But held together with both my heat and power, she was substantial enough to raise.\n",
      "Taking a deep breath, I gave the shade a gentle push. My power coaxed her from the body, guided her across the chasm separating the living from the dead.\n",
      "She emerged screaming."
    ]
  },
  {
    "name": "Grave Dance",
    "firstChapter": [
      "When I first straddled the chasm between the land of the dead and the world of the living, I accidentally raised the shade of our recently deceased Pekinese. The former champion dog floating around our backyard resulted in my father shipping me off to a wyrd boarding school. Seventeen years later, I still reached across that chasm, but now I got paid to do it.\n",
      "“That isn’t a body, John,” I said, staring at the open black bag. “It’s a foot.” A pale, bloated, waterlogged foot.\n",
      "John Matthews, personal friend and one of the best homicide detectives in Nekros City, nodded. “It’s a left foot, to be precise, and I have two more back at the morgue. What can you tell me?”\n",
      "I frowned and nudged the toe of my boot at a clump of grass sprouting between chunks of loose gravel. My business cards read: alex craft, lead private investigator and grave witch for tongues for the dead. I was actually the owner and only employee of the firm, but that was beside the point. I raised shades and gave the living a chance to question the dead—for a fee. My work tended to take me to a lot of graveyards, the occasional funeral home, and to the Nekros City morgue. The parking pit for the Sionan Floodplain Nature Preserve was most definitely not my typical working environment. Nor was a single severed appendage my typical job.\n",
      "“Sorry, John, but I need more than a foot to raise a shade.”\n",
      "“And I need some better news.” His shoulders slumped as if he’d deflated. “We’ve been scouring this swamp for two days and we’re turning up more questions than answers. We’ve got no ID on the vics, no obvious cause of death, and no primary crime scene. You sure you can’t give me anything?” As he spoke, he shoved the flap on the body bag farther open with the butt of his pen.\n",
      "The foot lay in a sea of black plastic. The sickly scent of rot filled the humid afternoon air, coating the inside of my nose, my throat. The bloodless skin had sloughed off the exposed ankle, the strips of yellowish flesh shriveling. My stomach twisted and I looked away. I’d leave the physical inspection to the medical examiner—my affinity for the dead was less tangible and more spectral. Memories hid in every cell of the body. Memories that my grave magic could unlock and give shape as a shade. Of course, that depended on having enough of the body—and thus cells—at my disposal for my magic to fill in the gaps. I didn’t need to cast a magic circle and begin a ritual to know I couldn’t pull a shade from the foot. I could sense that fact, the same way I could sense that the foot had belonged to a male, probably in his late sixties. I could also sense the nasty tangle of spells all but dripping from the decaying appendage.\n",
      "“The foot is saturated with magic. Some pretty dark stuff from the feel of it,” I said, taking a step back from the gurney and the sticky residual magic emanating from the foot. “I’m guessing you already have a team deciphering the spells?”\n",
      "“Yeah, but so far the anti–black magic unit hasn’t reached any conclusions. It would really help if we could question the victim.”\n",
      "But that wasn’t going to happen with such a small percentage of the body. “You said you had a matching foot back at the morgue? Maybe if we assemble all the parts, there will be enough to—”\n",
      "John shook his head. “Dancing jokes aside, unless this guy had two left feet—literally—neither of the other feet belong to him.”\n",
      "Three left feet? That meant at least three victims. “You’re thinking serial?”\n",
      "“Don’t say that too loud,” John said, his gaze flashing to a passing pair of crime scene technicians headed toward the dense old-growth forest. “No official determination yet, but yeah, I’m thinking serial.” His grizzly bear–sized form sagged further and his mustache twitched as he frowned. The mustache had been a thick red accent to his expressions as long as I’d known him, but in the weeks since he’d woken from a spell-induced coma, slivers of gray had joined the red. He pushed the flap of the body bag closed. “Park rangers found the first foot yesterday morning when they were checking the paths after the recent flooding. We got wardens and cadaver dogs out here and the second foot turned up. When we found the third, I pulled some strings to hire you as a consultant.”\n",
      "“Do you want me to stick around? Wait and see if your guys find more of the body?”\n",
      "“Actually”—John rubbed a hand over his head, wiping away the sweat glistening in his spreading bald spot—“I was hoping you’d join the search.”\n",
      "I hesitated. I probably even blanched. Wandering around with my shields down sensing every dead creature most definitely was not my idea of a good—or safe—time.\n",
      "John didn’t miss my pause. “You’ve located DBs before,” he said. DBs as in dead bodies. “And the paperwork you signed covered the possibility of searching the swamp, so you’ll be paid for your time.”\n",
      "I opened my mouth to respond—while I might have qualms about opening my psyche to whatever might be in the floodplain, we both knew I’d risk it—but I was interrupted before I could answer.\n",
      "“What’s wrong, Craft?” Detective Jenson, John’s partner, asked as he stepped around the side of a black SUV. “Don’t want to get those tight pants dirty tromping through the swamp? Got another TV appearance to run off to? Or maybe your magic eye license doesn’t allow you to do any good old-fashioned legwork.”\n",
      "I glared at him, but I had to unclench my gritted teeth to answer. “Way to be hypocritical, Jenson, insulting me and in the same breath asking me to use magic to help.” The term “magic eye” was derogatory slang for a witch PI.\n",
      "“I’m not asking you for anything.” He leaned back on his heels and crossed his arms over his chest. “And I think this city has seen enough of your magic lately, what with the way they keep rebroadcasting that interview with you getting all touchy-feely with a ghost.”\n",
      "“What’s wrong? Jealous?” I asked, cocking a hip and tossing curls out of my face. Okay, so I was goading him, but he was being an ass. A few days ago I’d participated in the first studio interview of a ghost, and to keep said ghost visible I’d had to remain in contact with him, but I’d most certainly not gotten “touchy-feely” or any such crap.\n",
      "John cleared his throat. “That’s enough.” He glanced between us, then turned to his partner. “Get Alex some hip waders and let the wardens know we’ll be joining them.”\n",
      "Jenson sneered at me—an expression I returned—and said, “Sure. Boots for the two-legged corpse hound. I’ll get right on that.” He disappeared around the side of the SUV.\n",
      "I stared at the spot where he’d been standing. “What a jerk.” Things hadn’t always been so antagonistic between us. In fact, we’d almost been friends. Then a month ago his attitude had gone to shit. The change coincided perfectly with John taking a spelled bullet aimed at me. Coincidence? Doubtful.\n",
      "“I don’t know what’s going on between you two,” John said, turning back toward me, “but let’s not forget we’ve got three severed feet and no leads. Now before we go in there, I suggest turning your shirt inside out.”\n",
      "“You what?”\n",
      "John waved a tech over to take custody of the bagged foot, then he scooped my purse off the ground where I’d set it earlier. He handed the red bag to me and nodded toward his car.\n",
      "“The park rangers warned us when we started searching that the local fae delight in leading hikers astray. The unwary can end up wandering through the same patch of land for days. Pixie-led, they call it. Turning your shirt inside out is supposed to confuse their magic.”\n",
      "I glanced down at my tank top, the shirt clinging to me in the afternoon heat. “Are you thinking fae are involved in the murders?”\n",
      "John’s mustache twitched. “That’s another thing you shouldn’t say too loud.”\n",
      "“Right.” I ducked inside John’s car to shimmy out of the top. Not that I thought reversing it would really protect me against fae magic. The fae relied mostly on glamour—a belief magic so strong it could reshape reality, at least temporarily.\n",
      "By the time I’d redressed, Jenson had dropped off a pair of hip waders for me. They were a thick, waterproof one-piece with suspenders and attached boots. I stepped into them, pulling the brown material up over my clothes. They nearly reached my collarbone.\n",
      "“We aren’t seriously planning to wade chest-deep, are we?” I asked as I adjusted the suspender straps.\n",
      "John, who’d also suited up in a pair of waders, handed me a plastic bottle of water. “Nah. With the speed the water is retreating, we’d be in danger of getting swept away. If you sense the bodies in the deep water, we’ll have to send a team out. Ready?”\n",
      "I nodded and followed him toward the closest path into the floodplain. John collected a couple of officers as we trekked into the forest, and I wasn’t the least disappointed when Jenson didn’t join us. The forest canopy filtered the sun, but the humidity under the trees hung heavy, making the air thick. Sweat coated my skin and my blond curls clung to my cheeks and neck. I cracked the seal of my water bottle, but took only one long swig—no telling how long we’d be hiking.\n",
      "“That is where the first foot was found,” John said after we’d been walking half an hour. He nodded ahead of him to where yellow crime tape ringed the path. “The second was found about a quarter mile farther up the path; the third a mile or more to the south. We’re not sure yet if the recent flooding unearthed shallow graves or if the bodies were dumped farther upstream and floated into the floodplain, but with the speed the water is retreating, every passing minute increases the chance of our evidence washing away. We need to find those bodies.”\n",
      "And that was my cue.\n",
      "I unclasped my silver charm bracelet. Among other charms, the bracelet carried the extra shields that helped buffer the excess of grave essence always trying to drag my psyche across the chasm to the land of the dead. Of course, that was the very chasm I now needed to traverse. As soon at the silver charms lost contact with my skin, a frigid wind lifted around me—the chill of the grave clawing at my remaining mental shields. I cracked those shields, imagining the living vines I visualized as my personal mental wall slithering apart, opening small gaps to my psyche.\n",
      "The world around me lost the rich hues of life as a gray patina covered everything. My vision doubled as I saw both the land of the dead and the land of the living. In my grave-sight, the trees darkened, withering, their thick green leaves turning brown, and the officers’ clothing decayed, the cloth becoming threadbare and moth-eaten. Under those mottled rags, their souls shimmered bright yellow. I looked away.\n",
      "Unfortunately, opening my shields exposed me to more than just the land of the dead. The Aetheric—the plane in which raw magic existed—snapped into focus around me in swirls of brilliant red, vivid blues, and every other color imaginable. The magic twisted, tauntingly close, but I ignored the raw energy. It wasn’t supposed to be visible, even with my shields open. Witches didn’t physically interact with the Aetheric plane. It wasn’t possible. Or at least it shouldn’t have been. But I’d been able to see the Aetheric, to reach it, ever since the Blood Moon a month ago.\n",
      "Being able to do something didn’t mean I should. Or that it was safe.\n",
      "I ignored the colors, forcing my eyes to focus on the decaying forest as I reached out with my senses, feeling for the grave essence leaking from the dead. And there was no shortage of dead in the floodplain.\n",
      "The grave essence from a dead doe reached for me like cold wind trying to cut into my skin. And to think I was hot a minute ago. Her remains were no more than fifty yards from where I stood, but I pushed my senses further, skimming over the traces of small animal bodies and not letting the grave essence sink into my being. I trekked deeper into the floodplain, my magic flowing around me.\n",
      "The path washed out not far from where the first foot had been found, and the mud made squishing, sucking sounds under my boots until even that gave way to dark water. Foliage, simultaneously healthy and decaying, withered as my gaze moved over it, and I hoped my attention didn’t damage the plants. I’d once crumbled a set of stairs when my powers pushed the land of the dead into reality.\n",
      "“Anything?” John asked, trudging behind me.\n",
      "Yeah, lots of things. Small animals mostly. Not exactly what we were looking for. I waved him off and kept walking. The water splashed up to the knees of my waterproof suit as I waded through it, my steps slow, both from the water rushing around me and because I was concentrating on feeling the grave essence while holding it at bay so I didn’t accidentally raise any shades.\n",
      "Something . . . I turned in a small circle, reaching with my mind, my power. Yes, there was something. My power told me it was touching a body, a human body. Male. And I felt a female too. And . . . two more males?\n",
      "“This isn’t good.”\n",
      "John stopped beside me. “You found something?”\n",
      "“Bodies. And I hope I’m wrong, but I’m sensing four different essence signatures.”\n",
      "“A fourth victim?”\n",
      "I wasn’t sure, so I didn’t answer. I wished I could close my eyes and concentrate just on the feel of the bodies, to get a better sense of where they were located, but it was hard enough to navigate the flooded forest with my eyes open. I waded farther in, the water lapping up to my mid-thighs. I slipped once, and only John’s quick reflexes kept me from landing on my ass in the murky water.\n",
      "“We might be getting too deep,” John said as one of the officers, the shortest in our group, lost his footing and slipped forward in the current. He dug in his toes and righted himself a moment later.\n",
      "I shook my head at John. “We’re almost there.” I could feel the bodies just ahead.\n",
      "The rushing water broke around a fallen tree a couple of yards in front of us. The ancient hardwood’s giant roots stretched out in every direction, dirt still covering them so the root-ball formed a massive mound. The tree hadn’t fallen in this particular flood—moss covered the mound and saplings clung to the root-packed earth. The grave essence emanated from somewhere around that tree, and not only grave essence but a dark knot of magic.\n",
      "I stepped closer, searching with both my power and my eyes. Then I saw them.\n",
      "“Feet.”\n",
      "“Where?” John asked, looking around.\n",
      "I pointed. In a hollow near the base of the tree was a neatly stacked pile of bloated and decomposing feet. John’s bushy eyebrows drew together, his mustache twitching downward as he frowned. He mopped sweat off his forehead before tilting his head to the side and giving me a confused look.\n",
      "He doesn’t see them? I pointed again, but I wasn’t wearing gloves, so I didn’t want to contaminate the scene. Trying to figure out the differences between what I could see and what he could see was impossible while staring over multiple planes of reality, so I closed my mental shields, blocking my psyche from the land of the dead—and whatever other planes it touched. My grave-sight faded. The gray coating of the world washed away, as did the swirls of the Aetheric. And so did the feet.\n",
      "I blinked as I clasped my shield bracelet back around my wrist. Releasing my grave-sight made dark shadows crawl over my vision—I couldn’t peer across planes without paying a price—but when I squinted I could make out the hollow where I’d seen the feet. An empty hollow. Or, at least, it looked empty, but I could still feel the grave essence and the taint of magic lifting off the dead appendages. The essence raked at my shields like icy claws, trying to sink under my skin, into my mind. I shivered. The feet were definitely there.\n",
      "“John, we have a problem,” I said, leaning back and trying to shove my hands in my jean pockets—which were blocked by the rubber hip waders. I dropped my hands by my side as everyone looked at me. “There’s a pyramid of feet stacked in that hollow. I counted four and at a guess, they are all lefts.”\n",
      "One of the uniformed officers stepped forward. He lifted a long sticklike object with a glass bead on the end. Spellchecker wand. He waved the wand over the hollow. The bead flashed a deep crimson to indicate malicious magic, but the glow was dim, the magic only traces of residual spells.\n",
      "Stepping back, the officer shook his head. “No active spells, sir.”\n",
      "I stared at the empty-looking hollow. “If they’re not hidden behind a spell, it has to be glamour.”\n",
      "“Crap,” John said, and turned toward the cop beside him. “Someone get the FIB on the phone. We’ve got a situation.”\n",
      "The FIB, as in the Fae Investigation Bureau. Glamour was exclusively fae magic, which meant John had just lost jurisdiction.\n",
      " \n",
      "***\n",
      " \n",
      "I slouched in the front of John’s police cruiser, one foot on the dash, one hanging out the open door. I’d rather have been out of the car—or more accurately, out of the floodplain. The FIB had arrived and ruffled the cops’ feathers. In turn, the cops dashed around, trying to look busy. I was just trying to stay out of the way. But being in the car made me claustrophobic. Actually, if I was honest with myself, it was more than that. Ever since the Blood Moon, being locked inside a car made me jumpy and made my skin itch. I had a sinking suspicion the sensation had something to do with the iron content in the metal. No wonder Falin drove that hot plastic convertible.\n",
      "The thought of Falin Andrews made my gaze twitch toward the rearview mirror and the two FIB agents reflected in it. I’d met Falin a month ago when he’d been working undercover as a homicide detective on the Coleman case. In truth he was a FIB agent—and a fae—and during the course of the case he’d ended up under my covers as well. But I hadn’t heard from him in weeks. As the two FIB agents approached, I could see there was no shock of long blond hair or a towering swimmer’s build among the agents who’d responded to John’s call. I wasn’t sure yet if I was grateful or disappointed.\n",
      "“Miss Craft?” A woman in a tailored black power suit approached the car.\n",
      "Here we go. I nodded, jerking my foot from the dash as I stood.\n",
      "“I’m Special Agent Nori.” She didn’t extend her hand. “You were the one who found the remains in the hallow?”\n",
      "Again I nodded, sliding my hands into my back pockets. It had been nearly an hour since I’d released my grave-sight, and my vision was returning to normal, but I still squinted as I studied Agent Nori. She was a couple of inches shorter than me in her fat-heeled pumps, but she stood completely straight, making the most of her height. She wore her dark hair slicked back like shiny black armor and her piercing eyes were set close enough that her sharp features seemed to come to a point in the front of her face. Or at least, that’s what she looked like currently. Being an FIB agent meant she was probably, but not necessarily, fae. What she might look like under her glamour was anyone’s guess. I could have dropped my shields and found out, but one, it would have been rude, and two, and perhaps more importantly, my eyes glowed when my psyche peered across planes, so she would have been able to tell. I wanted to get out of here without issue.\n",
      "“Can you tell me how you were able to pierce the glamour?” she asked, which was exactly the question I’d feared. Luckily I hadn’t been waiting idly. I’d been planning my answer.\n",
      "“I was helping the police search for the remains of the . . . remains, by using my grave magic. The glamour didn’t affect the fact that I could feel the grave essence emanating from the feet.” I left out that I’d been able to see them. Fae didn’t tend to like it when people could see through glamour. You could lose your eyes for less.\n",
      "She pressed her lips together and jotted something on her notepad. “So you followed this . . . essence? Then what?”\n",
      "“I tracked where the grave essence originated. I could feel that the body parts were there. The fact that no one could see them was a good hint we might be dealing with glamour.” All true—just not all of the truth.\n",
      "Agent Nori clicked her pen closed. “Miss Craft, when you realized glamour was involved, you didn’t for a moment think it might have been more prudent to inform the FIB rather than let the mortals blunder around the scene?”\n",
      "I bristled at the insult toward John and his team. I had a lot of friends in the Nekros City Police Department. Placing a hand on my hip, I lifted one shoulder in a shrug. “They hired me.”\n",
      "“Yes, well, I’m sure they appreciate your help, Miss Craft. Your services will no longer be needed.” She turned, gravel crunching under her pumps as she walked away. A few feet past the car, she glanced back over her shoulder. “You realize, of course, that this means we’ll have to look into the independent fae in the area.” The smile that spread across her face made her brilliantly red lips stretch to flash a lot of white teeth, but it wasn’t a happy smile.\n",
      "I didn’t balk. I’d recently learned I was feykin, but she couldn’t know that. Could she? Plastering on my own smile, I said, “I guess so.”\n",
      "She left the small gravel parking lot, no doubt headed, back to the place where I’d found the pyramid of feet. As I turned to slide into the car again, movement at the tree line caught my eye. While my eyesight had recovered significantly, I’d been in touch with the land of the dead and the grave quite a bit, so at first all I could see was a moving man-shaped mesh of colors. But as the figure drew closer, I quickly realized that while male was the right gender, he wasn’t human, but fae.\n",
      "He hunched, his stringy legs never fully straightening as he slunk closer. Even bent, he stood a head taller than me—and I’m not short. He had the same features as a human, but they were all slightly off. His wide eyes were dark, and overly recessed in his skull, but not from illness. His pale skin was the color of a worm’s belly, as if he had never been exposed to daylight, and his hawkish nose extended nearly a hand’s width from his face, almost hiding the thin lips and pointed chin.\n",
      "Even now, seventy years after the Magical Awakening, it was rare to see an unglamoured fae. The fae had come out of the mushroom ring, as some put it, because they were fading from memory and thus the world. They needed human belief to anchor them to reality, but aside from the fae celebrities and politicians, a human was likely to see an unglamoured fae only in a venue that profited from showcasing the fae’s differences. Most of those places were little better than tourist traps.\n",
      "I glanced behind me. Across the parking pit, two officers huddled around the van that had been established as a temporary headquarters for the investigation. Well, at least I’m not completely alone. Of course, just because the strange fae looked creepy and was near the place where we’d found feet masked in glamour, that didn’t make him guilty. It did make him a suspect, though. Or possibly a witness.\n",
      "“Can I help you?” I yelled the question louder than needed, but I wanted to ensure that the officers also heard me. They would want to question the fae.\n",
      "He paused, then hurried forward in a blur of movement. He crossed from the far edge of the parking lot to the front of John’s car before my heart had time to crash in a loud, panicked beat. The cops yelled something I didn’t catch above the blood rushing in my ears.\n",
      "“Can I help you?” I asked again, not daring to look away from someone who could move as fast as this fae. I slid back a step, and then another, the movement far too slow.\n",
      "“Are you daft?” he asked, his thin lips splitting with the words to reveal pointed teeth.\n",
      "I blinked at him, startled, but not because of the implied insult in his words, or because of the threat in his expression. No, my shock came at the sound of his voice. The voice that emerged from that thin, awkwardly threatening body was a rich, deep baritone that made even such an angry question sound musical. He had the kind of voice that, in the old folktales, would have drawn children and young women from their beds. Unfortunately, most of those stories didn’t end well.\n",
      "“I don’t know what you mean,” I said, taking another step back. Across the parking pit, gravel crunched under the cops’ running steps. Close. Maybe not close enough.\n",
      "“Those feet were hidden for a reason.” The fae’s gaze moved over my head, and his eyes narrowed. “This is your fault, and you will regret your actions,” he said. Then, as the cops neared us, he turned, dashed back to the tree line, and disappeared.\n",
      " \n",
      "Chapter Two\n",
      "“So the cops couldn’t find him?” Holly, my housemate and best friend, asked as her fork slid smoothly through the slice of triple chocolate cheesecake sitting in the center of the table.\n",
      "I nodded. “He issued his threat that I would regret leading the police to the feet, and then he ran. Once he reached the tree line, he might as well have been gone.” I’d been jumpy for hours after leaving the floodplain, but today, in the afternoon sun, my tension seemed foolish. “The only thing I regret at the moment is that the FIB took over the case.”\n",
      "Holly shot a conspiratorial glance at the third person at the table, my other best friend, Tamara, and then leaned forward. “Did you-know-who show?”\n",
      "I frowned at my fork. “You-know-who” would be Falin, the only FIB agent the three of us knew on a first-name basis. Well, actually, I knew him a lot better than just that. Even so, two days after we’d closed the Coleman case, he’d taken off without so much as a good-bye.\n",
      "I stabbed the cheesecake with a little more force than the smooth texture required. “He’s probably working some far more important case,” I said, then swallowed the bite of cheesecake without tasting it. “Good riddance. He’d complicate things.”\n",
      "Holly pulled the cheesecake away from me. “Okay, so I know we have to eat this before it melts—whose idea was it to meet for lunch at an outdoor café anyway?—but don’t scarf it. These kinds of calories have to be savored.”\n",
      "Tamara murmured in agreement and brandished her fork. “Oh, I’m in calorie bliss over here,” she said. “And today was Alex’s location choice.”\n",
      "I shrugged. “I raised a shade to settle an insurance claim this morning. The family refused to believe their father had left a chunk of his estate to an illegitimate son’s widow, so I spent over two hours graveside while the shade verified the will line by line. I was cold. Besides, it’s not half as hot as it was a couple of weeks ago. The mid-nineties are practically a blessing in August.”\n",
      "“Unh-uh,” Holly said and made a production of sipping her iced latte. But though we were at an outdoor café, it was a café in the middle of the Magic Quarter—Nekros City’s central for all things magical and witchy. This café boasted the very best charms available for keeping customers cool and comfortable regardless of the temperature. And despite her protests, Holly wasn’t so much as breaking a sweat in her crisp courtroom-ready suit. “So was there anyone else interesting?” she asked, wiggling her eyebrows suggestively.\n",
      "“Hardly.” I had to reach across the table to get to the cheesecake, but that didn’t stop me.\n",
      "“Oh, come on.” Holly pushed the plate forward. “It’s been a month since I’ve seen you pick up a guy. You’ve always accused me of being a workaholic, but ever since your business picked up, all you do is raise the dead.” She set down her latte, pulled out the hairstick holding her hair, and shook her red locks free. Then she smoothed her hair back again and twisted it effortlessly into a slick bun. She looked every inch the hotshot public prosecutor she was—less obvious was the fact that she was a witch in her own right. “I have court again this afternoon, but after that my caseload will be lighter. Let’s go barhopping tonight. You need to get out.”\n",
      "I made a noncommittal noise and focused on my once again empty fork.\n",
      "“She is out,” Tamara said, though I had the feeling her coming to my defense had more to do with her new disapproval of barhopping—a stance she’d taken about the same time the large diamond engagement ring had appeared on her finger—than with my current social habits.\n",
      "Holly wasn’t exactly wrong. Business was good. Really good. In fact, it was better than it had ever been. But business wasn’t why I’d stopped barhopping. For years I’d chased away the chill that clung to me after raising shades with a stiff drink and a warm body—preferably a guy I’d never see again after our encounter. That prospect didn’t appeal to me anymore. Besides, somewhere between temporarily swapping life forces with a soul collector and discovering I was part fae a month ago, my body temperature had changed, and now most people felt blisteringly hot to the touch. There was a short list of guys who could touch me without causing us both discomfort. Actually it was a very short list. As in a list of two. That I knew of, at least. One guy had disappeared and the other—well, that situation was complicated. It was time to change the subject.\n",
      "I turned to Tamara, who, as well as being my friend, was the chief medical examiner for Nekros City. “So did the FIB take everything out of house?”\n",
      "“Not yet. So far everyone is ‘cooperating.’ We’ll see how long that lasts. Honestly, though, I’m out of my league. I have seven left feet in the freezer, and I have no idea how they were severed from the legs. There are no tool marks, so I’m inclined to believe the dismemberment is connected to the snarl of magic clinging to the feet, but I’ve had no luck discerning any individual spells.” She shook her head, her lips thinning as her eyes moved past us. She was one of the foremost sensitives in the state. If neither she nor the anti–black magic unit was having any success, the spells must have been rare and powerful. She shook her head again. “Maybe I’m losing my edge. I also have three bodies on the slab with no clear cause of death. All the evidence points to their hearts simply ceasing to beat, but why? I still don’t know. I need to run some more tests.” Her gaze fixed on the cheesecake. “I paid for a third of that slice. I expect to eat my third, so don’t you hoard it.”\n",
      "“Take it, girlfriend,” Holly said, pushing the plate across the table. “Sounds like you two need it more than me. All the cases I’m working for the DA are pretty dull.”\n",
      "She updated us on the case she’d be trying in court this afternoon. As she spoke, a shadow caught my eye. We were in the outdoor seating area of a café on a busy corner in the Magic Quarter, so one more passing person shouldn’t have snagged my attention. Of course, this wasn’t just any random stranger.\n",
      "“That’s him,” I hissed.\n",
      "Holly fell silent and Tamara twisted in her chair. “Who? Where?”\n",
      "“The fae from the floodplain. He’s over by the magazine rack.” I pointed at the newsstand across the street. The fae, with his strange slumped stance and hawkish nose, held a copy of what looked suspiciously like Fae Weekly—a gossip rag—but his attention wasn’t on candid pictures or exaggerated articles. His gaze locked with mine, and I swallowed hard.\n",
      "“The police issued a BOLO, be on the lookout, on him, right? As a person of interest in the case? I’m calling the station.” Holly pulled her phone from her clutch, but she hadn’t yet flipped it open when a scream rang out down the street.\n",
      "For one stalled moment, the café went quiet as all conversation stopped and the patrons turned to look. My gaze tore free of the fae and I whirled around. A block up the street, cars slammed on brakes, horns blaring, and pedestrians ran inside buildings. Tamara jumped to her feet, Holly right behind her.\n",
      "I glanced back to where the fae had stood, but he’d vanished. Of course, that didn’t mean he was gone. What is going on?\n",
      "A car swerved, wheels screeching as it braked, and my attention snapped back to the commotion in the street. More screams sounded as people ran, and the air tingled with dozens of charms being activated at once. Then the cause of the panic became sickeningly apparent.\n",
      "A hulking form lunged onto the hood of a car, which buckled under the beast’s weight. I stared, rooted to the spot for one dropping heartbeat. I’d never seen anything like it. I would have said the creature was a wolf, except it was the size of a grizzly bear and covered in shaggy moss green fur. A fae beast. It tipped its head back, its nose working the air. Then its red-tinted gaze swung toward the café. Metal bunched under its claws as it hurled itself off the car.\n",
      "Oh, crap."
    ]
  },
  {
    "name": "Grave Memory",
    "firstChapter": [
      "\"What do you think?” I asked, as I fumbled for the light switch. An incandescent bulb flickered on, and then continued flickering. I frowned at it, but the late-afternoon sunlight streaming through the grimy picture window prevented the gloom from devouring the room.\n",
      "Rianna peered through the open doorway but made no effort to enter. Her hand fell to idly scratch behind the ear of the barghest who acted as her ever-present shadow. “What am I supposed to be looking at?”\n",
      "“The official office for Tongues for the Dead,” I said, waving a hand as if presenting the room.\n",
      "Rianna had first suggested we open a PI firm that solved cases by questioning the dead when we were still in academy, but by the time I’d finished college, she’d vanished. Three months ago I’d found and liberated her from a power-hungry fae who’d made her a captive changeling of Faerie, and in the wake of recent chaos, we were both healing, adapting, and rebuilding. Which, in my opinion, made now the perfect time to give the dreams of two idealistic schoolgirls a second chance.\n",
      "Rianna obviously didn’t agree.\n",
      "“Alex, I think you might need to give your eyes a little more time to recover.”\n",
      "“This place isn’t that bad,” I said, glancing around the room I envisioned would be a reception lobby—you know, if the firm ever became profitable enough to hire a receptionist. My gaze skidded over walls covered in layers of graffitied runes and minor, mostly dispersed, spells, before moving on to take in the balding carpet, and the piles of beer cans and cigarettes tossed haphazardly around the otherwise empty room. “It just needs a little TLC.”\n",
      "Rianna cocked an eyebrow, and the barghest, Desmond, who was in his customary shape of an oversized black dog with red-ringed pupils, huffed, making his jowls billow.\n",
      "“Okay, so it needs a lot of work, but the rent is affordable”—barely, and only because my landlord waived the rent on my loft as payment for the last big case I’d worked—“and it’s in the Magic Quarter. A definite perk as we offer magical solutions in our investigations.”\n",
      "“Alex, this is a seedy back alley on the very edge of the Magic Quarter. We’re about as far as we can be from the heart of the Quarter. No upscale restaurants. No spell boutiques. Not even the kitschy stores hawking overpriced, underpowered charms to norms are out this far.” She glanced over her shoulder at the only other door in the admittedly less than ideal alley and lowered her voice. “And I’m pretty sure that unmarked shop is dealing black magic.”\n",
      "“Gray actually,” I said and her eyes widened. “Hey, it’s not like I went shopping. I just sensed a couple of mild compulsion spells and a lot of weak love charms when I passed by the shop. I think it’s run by a matchmaker.”\n",
      "“And you were planning to call the OMIH when, exactly?”\n",
      "The Organization for Magically Inclined Humans was originally formed as an advocate group for witches during the turmoil following the Magical Awakening. A good seventy years later they were still considered the public face of the witch population, but now their mission statement focused on education and promoting the safe and ethical use of magic. That, of course, meant they policed their own.\n",
      "“Keep your voice down,” I hissed. I had no desire to irritate a neighbor willing to spin gray spells—which were a short step from the really dark, soul damaging stuff. “I contacted the OMIH already. They’re supposed to send an inspector out this week, and once they confirm my report, they’ll alert the Magical Crimes Investigation Bureau.” Which sounded like a lot of tedious bureaucratic red tape. But despite the fact I was an OMIH certified sensitive, citizens couldn’t contact the MCIB directly so we’d have to wait. The unmarked door on the other side of the alley opened, and I ducked back into the office we were actually supposed to be discussing. “Once we fix this place up, it could be nice. It has the lobby area, a bathroom, and two offices. Exactly what we need,” I said, as if we’d never veered off the subject.\n",
      "Rianna frowned and curled her fingers in Desmond’s fur. “You can see again, so you don’t need me to substitute anymore, and we both know there isn’t enough business to justify the overhead of an office. Especially when you were doing fine running things through phone and e-mail.”\n",
      "Well, not always fine. At times I’d barely scraped by, which only highlighted her point. But I had other reasons I wanted to open an office.\n",
      "When I first emancipated Rianna, she’d been reluctant to spend time in the mortal realm. But when I’d lost my sight several weeks ago after a showdown with a witch who thought the world would be better if all the planes of existence touched—yeah, no, bad idea—Rianna had stepped up and covered my cases. At first she’d left Faerie for only a couple of hours on the days rituals were scheduled. But recently she’d been spending almost all day, every day in Nekros, and while her visits hadn’t completely erased the wraithlike appearance she’d had as Coleman’s soul-chained captive, she now had color in her cheeks and the bruiselike circles no longer ringed her eyes. The mortal realm agreed with her. I didn’t want her to disappear into Faerie again.\n",
      "Besides, my ability to raise the dead was wyrd magic, and if I didn’t use it, it used me. Over the last few weeks I’d had to perform a couple of off-the-books rituals, holding the shades just long enough to relieve the magical pressure on my shields. But even those limited rituals had come at a higher cost than before. If I returned to raising shades several times a week I’d be permanently blind before I hit thirty. Tongues for the Dead needed a new business model.\n",
      "“I was actually thinking about expanding the firm’s services. Take on some cases with billable hours not restricted to rituals and talking to shades. Cases that utilize more . . . traditional forms of investigation.”\n",
      "“Traditional investigation?” She cocked her head to the side. “Like what? Surveillance? Tailing spouses suspected of cheating? Maybe a stakeout?” I didn’t miss the sarcasm in her tone. Rianna and I were all but night blind, to say nothing of my degrading vision. Then there was the fact that as a changeling, Rianna couldn’t be in the mortal realm during sunset or sunrise without deadly consequences.\n",
      "“More like locating missing persons or artifacts, tracing the origins of spells or charms. Hell, we could even do background checks if someone would pay us. Between you graduating at the top of your class in spellcasting and me being one of the top five sensitives in the city, we have skills to offer besides grave magic.” I didn’t mention that she’d had a couple hundred extra years practice while in Faerie or that I had the whole planeweaving thing going on. Neither facts were something either of us wanted on a résumé. I turned back to the room, which she still hadn’t entered, and waved a hand to encompass the space. “Ignore the mess and imagine what this place could look like. For instance, take that picture window. Once it’s cleaned up, we can have ‘Alex Craft and Rianna McBride: Tongues for the Dead Investigations’ stenciled on it.”\n",
      "Rianna glanced at the window, which was coated in a decade’s worth of dust, but the faintest hint of a smile appeared at the edge of her mouth. “You’d put my name on it too?”\n",
      "“How could I not? You were the one who looked up from a mystery novel during your final year at academy and suggested the name.”\n",
      "The smile grew a little brighter. “I’d forgotten about that. It was so long ago.” She finally stepped inside, Desmond at her heels. “Show me around?”\n",
      "That task didn’t take long. The doors to the two offices were on opposite sides of the room, and neither office was large—or in better shape than the front room—but each had enough space for a desk, some filing cabinets, and a couple of chairs, which would be enough for meeting with clients. There was also a small closet and a bathroom against the very far wall, but neither of us were brave enough to see what condition it might be in, at least, not yet.\n",
      "“It’s going to take a lot of work,” she said as she surveyed the lobby.\n",
      "“Then you’re in?”\n",
      "“Of course I am.” The words were flat, void any excitement.\n",
      "I turned and studied her face. It was blank, unexpressive, and totally not the response I anticipated. “This isn’t that faerie master crap again, is it?”\n",
      "Sadly, it was a legitimate question. When I’d destroyed her former master, Faerie had passed all of his holdings on to me. That included an enormous castle straight out of a fairy tale and his prize changeling, Rianna. I had no interest in owning my childhood friend, but she was a changeling, bound to Faerie and its magic. If I renounced her, some other fae could take her. So I accepted the claim, and as far as Faerie was concerned, she was my property, obliged to my will.\n",
      "But I considered it political bullshit, and she knew it.\n",
      "“Rianna, you’re free to do whatever you want, including telling me you’ve outgrown your interest in being a private investigator.”\n",
      "“Al, don’t think that. It’s nothing like that.” She wove her fingers into Desmond’s fur again, and he leaned against her leg, offering his support. “It’s . . . I . . .” She shook her head. “Sometimes I forget that only a few years passed for you while I spent hundreds under Coleman’s control. The freedom to want things for myself, to reach for my own dreams—it’s something I nearly forgot. Having options is a little overwhelming.” She looked around the room, her gaze slow and assessing. A smile crept across her face as she peeked into one of the offices again. Then she turned toward me. “Yes, I want this. I want to be Rianna McBride, PI for Tongues for the Dead. Let’s do it, boss.”\n",
      "“Partner,” I corrected.\n",
      "“Partner.” The word was a whisper, but her smile spread, making her green eyes sparkle.\n",
      "“It’s official, then.” I glanced around the room, imagining what it could be. It was going to take a lot of work.\n",
      "“I guess we should start with paint,” Rianna said, following my gaze. “And something for the carpet?”\n",
      "“Some essential furniture too,” I said, digging through my purse. “But first . . .” I pulled out a thin rectangular box. I’d wrapped it in newspaper—wrapping paper was expensive and this counted as recycling, right? Rianna gave me a quizzical look as I handed it to her.\n",
      "“I didn’t get you anything,” she said, staring at the box in its makeshift wrapping.\n",
      "“Don’t be silly, just open it.”\n",
      "She bit her lip, as if unsure. Then a grin cut across her face and she lifted the box to her ear and gave it a good shake.\n",
      "“Hey, it could be breakable,” I said, and her grin grew.\n",
      "“Nah, you’d have stopped me earlier.” She tore into the packaging. Her perplexed look didn’t change when she pulled out a small metal container engraved with her initials, but when she flipped it open, she gave out a squeal of a laugh. “Business cards,” she said, pulling out the thin stack of cards. “And that’s the logo I tried—and failed—to draw. You nailed it. When did you have this done?”\n",
      "I shrugged, but I was grinning too. “I created the template years ago. But after you disappeared I didn’t feel right using it. These I had printed yesterday. I’m just glad you said yes.”\n",
      "She closed the lid and clutched the gift as if it were much more valuable than a cheap case and a handful of business cards. Then she bounced on the balls of her feet before scampering over to hug me. But she didn’t thank me. I don’t know if that was for my sake as I hated feeling the imbalance of debt, or simply because she’d lived among the fae so long. Either way, the hug expressed her gratitude more than sufficiently.\n",
      "“So, furniture,” I said as we headed back outside into the bright afternoon sun. “Unfortunately our budget is thrift, but maybe we’ll luck out.”\n",
      "I locked our new office and we headed up the alley with Desmond following in our wake, or maybe he was taking rear guard—it was always hard to tell what the barghest was thinking. Rianna had parked my car around the corner since, legally, I couldn’t drive. It was well documented that grave magic damaged the witch’s eyesight, so we were required to take a vision test once a year.\n",
      "Yeah, guess when mine had come due? My—suspended—driver’s license currently listed me as blind. If I could avoid any serious damage to my eyes, I hoped I could retake the test and pass next week.\n",
      "We were just passing the matchmaker’s door, the gray magic inside pricking at my senses, when Annabella Lwin began singing the chorus of “I Want Candy” in my purse. My phone. I dug it out but didn’t bother glancing at the display. When I’d replaced my phone yet again—the latest cellular casualty had been lost in Faerie—Holly, my housemate and good friend, had set her own ring tone.\n",
      "“Hey, Hol.”\n",
      "She didn’t bother with a greeting. “I want chocolate so bad, I may kill the next person I see with a Snickers bar.”\n",
      "“I sure hope you didn’t just say that in the middle of the courthouse.” After all, Holly was an assistant district attorney, and I was guessing that threatening to kill people over vending machine fare wouldn’t go over well.\n",
      "“I just left,” she said, and a horn blared through the phone.\n",
      "“So is this where I’m supposed to be the sympathetic friend to your chocolate plight or where I offer to meet you for lunch?”\n",
      "“Both? My last case for the day is over, so aside from a mountain of research, I’m free for the afternoon,” she said, and her horn sounded again. “God, what I wouldn’t do for just one piece of rich, dark chocolate.”\n",
      "I winced on behalf of the cars around her. I doubted they were driving any worse than most Nekros citizens or deserved the long blasts of her horn. Tilting the phone away from my mouth, I glanced at Rianna.\n",
      "“You up for a change of plans? We’ll furniture shop later. Let’s go celebrate the new business over lunch and drinks.”\n",
      "Rianna stopped, forcing me to turn on my heels and double back. “Where were you thinking?” she asked.\n",
      "“The Eternal Bloom—before Holly commits vehicular homicide.”\n",
      "“I heard that,” Holly’s voice snapped in my ear.\n",
      "Rianna frowned. “Doesn’t sound like much of a celebration if you can’t drink.”\n",
      "It was true, but there wasn’t anywhere we could go that all of us could lift a glass together. As a changeling, Rianna was addicted to faerie food, anything else she tried to eat turned to ash on her tongue. Holly wasn’t a changeling, not currently at least, but a month ago she’d been exposed to faerie food, and one bite was enough to addict a mortal. Not that she didn’t miss mortal food—hence her chocolate-withdrawal inspired rage. I sympathized. Which was why, despite the fact I’d recently learned I had more fae blood than not and was apparently going through some sort of fae-mien metamorphosis, I was avoiding faerie food. If I turned out too mortal to resist it, I was sure I couldn’t live without coffee and Faerie didn’t serve it. My abstention meant that going to Nekros’s local fae bar, the Eternal Bloom, excluded me from the meal. Unfortunately, since Holly was neither fae nor changeling, she couldn’t get into the VIP area, so she needed an escort and today was my day.\n",
      "“We’re not far from the Bloom,” I said, swiveling the phone back in front of my mouth. “You want to meet in about twenty—”\n",
      "A booming crash and the sound of shattering glass exploded from somewhere around the corner. The blare of first one and then the honks of several car alarms sounded.\n",
      "“—Shit!”\n",
      "“What the hell was that?” Holly asked, her voice pitched high. “Alex is everyone okay?”\n",
      "“I don’t know. It sounded like a car crash.” I broke into a run, Rianna at my side. Desmond raced ahead of us, a black blur as he bounded around the corner and out of the alley.\n",
      "“Are you okay? Anyone hurt?” Holly asked again.\n",
      "“We’re fine. Hang on a second,” I said, and then under my breath muttered, “That better not have been someone hitting my car.” It was new, and from the sound of the impact, something had taken major damage.\n",
      "As it turned out, major damage was an understatement. I breached the mouth of the alley and ground to a halt, my mouth falling slack at the scene in front of me.\n",
      "“Holly, I think we’re going to be late,” I said into the phone, but if she replied before I ended the call, I didn’t hear.\n",
      "A crowd was gathering in the street, people pouring out of shops and cars screeching to a halt as the drivers stared with pale, shocked faces. The impact we’d heard had been a car—not mine—a little red sedan parallel parked a few spaces behind mine. Glass littered the street and sidewalk around it from where it had exploded as the roof caved. But it wasn’t another vehicle that had hit the car.\n",
      "It was a body."
    ]
  },
  {
    "name": "Grave Visions",
    "firstChapter": [
      "The first time I raised a shade for profit, my client fainted. Since then, I’ve tried to better prepare clients for their encounter with the dead.\n",
      "It doesn’t always work.\n",
      "“You son of a bitch,” Maryanne Johnson yelled as she slammed her palm against the edge of my circle. “I knew you were sleeping with her.”\n",
      "The shade of her late husband didn’t respond. He sat motionless above his grave, his face empty and his gaze distant. That seemed only to irritate the woman more, and she slammed her hand against my circle again.\n",
      "“Ms. Johnson, calm down. He can’t understand your anger. He’s dead.”\n",
      "If she heard me, she gave no indication, and I shuddered as she hit the circle again, the impact vibrating through my magic. The circle wouldn’t hold much longer, and if it failed, I’d be standing in the middle of a graveyard with my shields wide-open. Not a good thing.\n",
      "“If you don’t take a step back, I’m going to have to end the ritual,” I said, moving around the grave so that I partially obscured her view of the shade.\n",
      "She didn’t listen.\n",
      "“This is between him and me.” She rummaged through her purse, muttering curses under her breath. When she looked up again, her smile was dark. She lifted a small revolver, leveling it at the shade. “How long were you with that hussy?”\n",
      "And that’s my cue to end the ritual.\n",
      "I didn’t repeat the question to the shade, because he would have answered. He would have had no choice. Shades were just memories with no will or consciousness. Matthew Johnson may have kept his mistress a secret during life, but he couldn’t hide the truth in death. And I had the feeling, regardless what his answer might be, it could only make this situation worse.\n",
      "I didn’t need that.\n",
      "“Rest now,” I whispered under my breath as I reached out with the part of me that sensed the dead and reversed the flow of magic that gave the shade form. The words weren’t strictly necessary, but I’d used them for so many years, they were now part of my ritual, producing a near Pavlovian response with my magic. The shade dissolved, the life heat I’d imbued in it rushing down the well-worn path of my psyche.\n",
      "“No. No. Bring him back.” The woman railed against the edge of my circle. “He died too easy the first time.” Without her target of choice visible, she swung the gun in my direction. “I paid for this ritual. Now bring him back.”\n",
      "I was seeing the land of the dead overlaying reality, but even if the revolver looked rusted and ruined in my sight, I had no doubt it was in fine working order in mortal reality. Ms. Johnson herself might have had enough innate magical ability that my circle stopped her from crossing into my ritual space, but unless her gun was loaded with charmed ammo—doubtful—my circle would do nothing to stop a bullet. Which meant I had to defuse this situation. Fast.\n",
      "“Ms. Johnson I think—”\n",
      "She cocked the gun.\n",
      "Right. One shade coming right up.\n",
      "I plunged my magic into the unseen corpse and pulled Johnson’s shade free again. He emerged looking exactly the same as the moment he’d died, right down to the bit of tomato soup in his beard.\n",
      "As soon as the shade appeared, the woman’s rage refocused on her deceased husband. The bullet she fired passed through the shade with no effect, but that didn’t diminish her fury. She fired off two more shots and I crept to the edge of my circle, trying not to attract attention as I dialed the police.\n",
      "I seriously needed to start screening my clients better.\n",
      "****\n",
      "“Alex, tell me you didn’t sleep here last night?”\n",
      "I jerked upright at the question and my chair rolled away from my desk. The coins I’d been analyzing before I’d nodded off scattered; several rolling over the side of the desk to fall with loud plinks onto the floor. I frowned at the sound and blinked bleary eyes as I tried to focus on the speaker.\n",
      "Rianna, my once-lost-now-found best friend and business partner, stood in the doorway of my office, her arms crossed over her chest as her green gaze swept over first me and then the mess that comprised my desk. At her side, the barghest who acted as her constant shadow huffed through his large jowls and shook his shaggy head.\n",
      "“Morning,” I said around a yawn. My neck and back ached—no doubt from sleeping in a chair—and I stretched, trying to work out the kinks. “What time is it?”\n",
      "“A little after eight. You have a . . .” She pointed to her temple and I placed a hand to the side of my face.\n",
      "One of the coins clung to my skin. I peeled it off, feeling the slightest tingle of a spell in the metal. Great, one magic coin in the whole lot and I’d slept on it. Of course, maybe it would do me some good. The spell felt like a fortune charm and goodness knew I could use a little luck.\n",
      "A glance over my desk turned up a blank form. I taped the coin in the provided box and jotted down my initial analysis. I’d do a more in-depth check on the spell later.\n",
      "After setting down my pen, I looked up to discover Rianna still standing in my doorway, her expression somewhere between concern and disapproval.\n",
      "“What? I had a lot to do.” I waved a hand to the mess of coins and forms. She cocked one dark eyebrow, clearly unconvinced. With a sigh, I slipped out of my chair and focused on gathering the escaped coins. Even through the solid wood of the desk, I could feel the weight of her stare.\n",
      "“Oh, yes,” she said, drawing out the words for emphasis. “That looks like an important case. One so pressing, it warranted working through the night.”\n",
      "I didn’t answer. Rianna and I both had our private investigator licenses, and as grave witches, our specialty was finding answers for our clients by questioning the dead. Analyzing charmed coins didn’t exactly fall within the typical Tongues for the Dead case description, but peering into the land of the dead to raise shades did nasty things to the eyes. So, I’d been searching out cases that wouldn’t make me blind before my thirtieth birthday. It didn’t pay nearly as well as raising shades, but it covered some bills without burning out my vision.\n",
      "“My last client got arrested before paying for her ritual,” I said, as if recouping the income justified working overtime on a simple spell-identification case we both knew wasn’t pressing.\n",
      "We also both knew exactly why I hadn’t gone home last night. He had a name.\n",
      "Falin Andrews.\n",
      "The Winter Queen’s knight was currently crashing in my one room loft. Considering we were occasionally lovers, that might have been okay, except that it was the Faerie queen’s royal decree placing him there and saying I suspected her motives was more than an understatement. He suspected them too—which was why he himself had told me never to trust him while he was under her rule. Oh yeah, and he’d told me that while holding me at dagger-point. Just after saying he loved me.\n",
      "Our relationship was complicated, to say the least. In the two weeks he’d been staying at my place we’d barely spoken, by mutual consent. And besides, I was sort of seeing someone else. Can we say awkward? Yeah.\n",
      "The office was a better option.\n",
      "When I remained quiet, Rianna joined me on the floor. Together we gathered the coins, the only sound the clicking of my dog’s nails on the wood as he moseyed over to see what we were doing—and if we had food.\n",
      "Rianna shot a glance at the small Chinese crested and frowned again. “PC’s with you, so I take it you never planned to go home last night? I thought you arranged to stay in Caleb’s guest room until you could figure out what to do about Falin.”\n",
      "“I did.” And it wasn’t so much that I’d worked it out as that Caleb, my landlord, had insisted. The problem was . . . “The guest room isn’t soundproof and I don’t think Caleb and Holly ever sleep.”\n",
      "“So they’ve officially hooked up?”\n",
      "“Who knows if it’s official, but they go at it like bunnies.”\n",
      "Rianna gave me a sympathetic glance as she passed me the last of the coins. “I’d invite you to my place, but . . .”\n",
      "But she lived in an enchanted castle in Faerie. Well, actually my enchanted castle, but I’d never been inside it. I’d inherited the castle in a rather grisly way and the whole thing creeped me out. Besides, I’d have to pass through the winter court to reach limbo, where the castle currently resided, and with the Winter Queen determined to add me to her court, it wasn’t worth the risk of her finding a reason to detain me. So yeah, not currently a viable option for a place to crash.\n",
      "I shrugged. “I’ll figure out something.” Climbing to my feet, I dumped the coins into a magic-dampening bag—my client thought they were cursed, and though I’d found no evidence of any malicious spells, better safe than sorry—before straightening. Rianna rose slower, levering herself up with the edge of my desk. She teetered when she reached her full height. I looked at her then, really looked at her.\n",
      "When I’d first rescued Rianna, she was a wasting shadow of her former self, but in the last few months, she’d reclaimed a soft glow of health. The glow was missing today, her cheeks pale and dark smudges ringed her eyes.\n",
      "“Are you feeling okay? I’m the one who passed out at her desk, but you look worse than I feel.” Though I was definitely feeling the weeks of gradual sleep deprivation.\n",
      "Rianna gave me a feeble smile before shrugging. “I think maybe I caught something.”\n",
      "“I didn’t know changelings could catch a cold.”\n",
      "Another shrug. “Apparently. It must be going around. Ms. B. won’t be in today. She said something about the garden gnome being unwell.”\n",
      "If I wasn’t frowning before, I definitely was now. When I’d inherited the castle, I’d also sort of acquired the people—well, two fae and one changeling—living in the castle. Like I said, creepy. The garden gnome I’d never met, but Ms. B was a brownie who’d tended the castle for longer than anyone seemed to remember. She’d taken a liking to me and recently decided to claim the roll of receptionist at Tongues for the Dead—I hadn’t had a say in the matter. She was gruff on the phone and some of our clients balked at her diminutive size and inhuman appearance, but I’d gotten used to having her around the office. I’d never heard of a fae getting sick, but honestly, despite the fact the fae had come out of the mushroom ring seventy years earlier, or the fact I’d recently discovered I was more fae than human, I didn’t know all that much about the day-to-day life of fae.\n",
      "“Well, I hope he recovers quickly. And you too,” I said, my frown deepening. Rianna was all but leaning on the barghest. The large doglike fae stared at her, concern clear in his red-rimmed eyes. “Do you have any rituals scheduled today?”\n",
      "She shook her head, swaying slightly with the movement.\n",
      "“Good. Maybe you should keep it that way.”\n",
      "She gave me a half nod, as if completing the movement would have taken too much energy. “I think I’ll go sit down.”\n",
      "“Do you need a healer? Or a doctor?”\n",
      "“No, I just . . .” She trailed off as she turned, swaying a moment before taking a breath and putting one foot very purposefully in front of the other. “This’ll pass in a minute. It’s happened a couple of times in the last week. Let me rest a moment.”\n",
      "I walked around my desk and helped her into one of the client chairs. She collapsed gratefully, but I didn’t get a chance to question her because my cell phone buzzed on my desk and I had to rush back around to grab it.\n",
      "The displayed number wasn’t one of my saved contacts, but I recognized the Central Precinct extension, so I guessed the caller. It had been a while since I’d heard from my favorite homicide detective, and our last few encounters hadn’t gone all that well, so I was relieved he was finally calling.\n",
      "“Hey, John,” I said, tucking the phone between my shoulder and ear and heading back to Rianna.\n",
      "“Craft?” a gruff male voice asked from the other side of the phone.\n",
      "It wasn’t John.\n",
      "I stopped in my tracks and briefly considered playing it off as a wrong number. If this was a client, professionalism was way past gone. But there was something familiar about the voice, I just couldn’t put a name to it. After an uncomfortably long pause, I confirmed he’d reached the right number.\n",
      "“This is Detective Jenson. I need you at the morgue in an hour.”\n",
      "He disconnected as soon as the last word escaped his mouth, leaving me no time to accept or deny his request. I pulled the phone away from my ear and stared at it like it might morph into something venomous. Because of my—largely unexplained—involvement in several major cases, John and I had suffered a falling out. But his partner Jenson? We’d never been close. And since my fae heritage had manifested, he’d been downright hateful toward me. Well, most of the time at least. It had been made clear to me that the police department wouldn’t be hiring me for a case anytime soon, so why did Jenson want me at the morgue?\n",
      "“Alex?” Rianna made my name a question, concern mixing with curiosity in her voice.\n",
      "I shook my head as I redialed the number Jenson had called from. The line rang four times before going to voicemail. Frowning, I ended the call without leaving a message.\n",
      "“Well,” I said, shoving the phone in my back pocket. “I either have a job . . . or I’m about to walk into a trap.”"
    ]
  },
  {
    "name": "Grave Ransom",
    "firstChapter": [
      "The first time I realized I could feel corpses, I had nightmares for a week. I was a child at the time, so that was understandable. These days I was accustomed to the clammy reach of the grave that lifted from dead bodies. To the eerie feeling of my own innate magic responding and filling me with the unrequested knowledge of how recently the person died, their gender, and the approximate age they were at death. When I anticipated encountering a corpse, I tightened my mental shields and worked at keeping my magic at bay. Usually that was only necessary at places like graveyards, the morgue, and funeral homes—places one might expect to find a body.\n",
      "I never expected to feel a corpse walking across the street in the middle of the Magic Quarter.\n",
      "“Alex? I’ve lost you, haven’t I?” Tamara, one of my best friends and my current lunchmate, asked. She sighed, twisting in her seat to scan the sidewalk beyond the small outdoor sitting area of the café where we were eating. “Huh. Which one is he? I may be married and knocked up, but I know a good-looking man when I see one, and girl, I don’t see one. Who are you staring at?”\n",
      "“That guy,” I said, nodding my head at a man in a brown suit crossing the street.\n",
      "Tamara glanced at the squat, middle-aged man who was more than a little soft in the middle and then cocked an eyebrow at me. “I’ve seen what you have at home, so I take it this is business. Did you bring one of your cases to our lunch?”\n",
      "I ignored the “at home” comment, as that situation was more than a little complicated, and shook my head. “My case docket is clear,” I said absently, and let my senses stretch. When I concentrated, I could feel grave essence reaching from corpses in my vicinity. All corpses. There were decades of dead and decaying rats in the sewer below the streets, and smaller creatures like insects that barely made a blip on my radar, but like called to like, and my magic zeroed in on the man.\n",
      "“He’s dead,” I said, and even to me my voice sounded unsure.\n",
      "Tamara blinked at me, likely waiting for me to reveal the joke. Instead I pushed out of my seat as the man turned up the street. Tamara grabbed my arm.\n",
      "“I’m the lead medical examiner for Nekros City, and I can tell you with ninety-nine point nine percent certainty that the man walking down the street is very much alive.” She put extra emphasis on the word “walking,” and on any other day, I would have agreed with her.\n",
      "My own eyes agreed with her. But my magic, that part of me that touched the grave, that could piece together shades from the memories left in every cell of a body, disagreed. That man, walking or not, was a corpse. Granted, he was a fresh one—the way he felt to my magic told me he couldn’t have been dead more than an hour. But he was dead.\n",
      "So how the hell had he just walked into the Museum of Magic and the Arcane?\n",
      "I dropped enough crumpled dollars on the table to cover my portion of the bill and tip before weaving around tables and out of the café seating. Behind me, Tamara grumbled under her breath, but after a moment I heard her chair slide back as she pushed away from the table. I didn’t wait for her to follow me out as I all but sprinted across the street to catch up with the walking corpse.\n",
      "The museum’s wards tingled along my skin as I stepped through the threshold. I’d been inside the museum a few times, and the collection of rare and unusual artifacts from both pre- and post-awakening was impressive, but I was a sensitive, capable of sensing magic, and between all the security wards and the artifacts themselves, the museum tended to be overwhelming. Definitely migraine-inducing in large doses. I noted that the magic in the air was particularly biting today, like one of the security wards had recently been triggered. I sucked in an almost pained breath, trying to adjust to the sudden crush of magic all around me. The extra sting of the deployed ward didn’t help.\n",
      "I should have walked the extra few steps to clear the entrance wards.\n",
      "I’d entered only minutes behind the man, but he almost barreled into me as the door swung closed behind me. His shoulder brushed me at the same moment he hit the antitheft wards, and several things happened at once. The wards snapped to life, blaring a warning to the museum staff to let them know something was being stolen. Simultaneously, a theft-deterring paralytic spell sparked across the would-be thief, locking his body—and the artifact—in place.\n",
      "Unfortunately, while the wards were powerful, they weren’t terribly specific. Where his shoulder touched mine, the spell jumped from him to me, immobilizing me as well. Under normal circumstances, that would majorly suck. Under these circumstances? It was so much worse.\n",
      "My magic still identified him as a corpse. I could feel the grave essence lifting off him, clawing at me. My mental shields, while strong, were already overwhelmed, and my magic liked dead things. A lot. I hadn’t raised a shade in nearly a week, so the magic was looking for release. Typically I made a point not to touch the dead. Now I couldn’t get away.\n",
      "My magic battered against the inside of my shields, looking for chinks in my mental walls that it could jump through. Fighting the spell holding me was a waste of energy—I was well and truly caught—so I focused all of my attention on holding back my own magic. But I could feel the chilled fingers of the grave sliding under my skin, worming their way into me and making paths for my magic to leach into the animated corpse frozen against me.\n",
      "I wanted to open my shields and See what the thing in front of me was truly made of. But if I cracked my shields to gaze across the planes of reality and get a good look at the body, more of my magic would escape. And too much was already whispering through my shields, making fissures where more could follow. Sweat broke out on my paralyzed brow as I poured my focus into holding my magic at bay.\n",
      "But I was touching a corpse.\n",
      "The grave essence leaking from the body clawed at the fissures my magic was chewing through my shields, and it was too much. If I could have stepped back . . . But I couldn’t.\n",
      "All at once a chunk of my mental wall caved, and the magic rushed out of me. Color washed over the world as the Aetheric plane snapped into focus around me. A wind lifted from the land of the dead, stirring my curls and chilling my clammy skin. I could now see the network of magic holding me in place, as well as the knot of magic in the sprung ward, but more importantly, I could see the corpse in front of me. And it was a corpse, no doubt about it, the dead skin sagging, bloating.\n",
      "But under the dead flesh, a yellow glimmer of a soul glowed.\n",
      "Which meant the body was both dead and alive. Considering it was up and walking around, it was a heck of a lot more alive than a dead body should have been.\n",
      "The soul inside was the color I associated with humans, so this wasn’t a corpse being worn and walked around by something from Faerie or one of the other planes. I still couldn’t see spellwork shimmering across the dead flesh, but it had to be there, binding the soul inside the corpse. But whatever kind of half-life the man existed in wasn’t going to last much longer if I couldn’t get hold of my magic.\n",
      "The hole in my shields wasn’t huge, but I could feel my magic filling the body. And the grave and souls didn’t get along. I couldn’t stop the hemorrhage of magic, but I managed to slow it to a trickle.\n",
      "I’d barely noticed the crowd gathering around us until one of the museum guards began releasing the spell holding us. If the antitheft paralyzing spell was dropped, I’d be able to get my distance from the corpse.\n",
      "But either he wasn’t a very good witch, or he was stalling—likely to wait for the cops—because he was taking his sweet time as more and more of my magic flowed out.\n",
      "I’d ejected souls from dead bodies before. While souls didn’t like the touch of the grave, they tended to cling to their flesh pretty hard and it took directed magic to pry them free. I was actively fighting expelling the soul, and only a small portion of my magic had filled the corpse, but the soul’s connection to the body felt weak, tentative.\n",
      "I couldn’t shift my gaze to the museum worker, but I could see him out of the corner of my eye. Oh please, release the damn immobility spell.\n",
      "Too late.\n",
      "In a burst of light, the soul popped free of the corpse.\n",
      "Nothing about the body changed. It had already been dead and it was still held immobile by the spell, but the soul stood free. For a long moment it was almost too bright to look at, a shimmering, crystalline yellow. But souls can’t exist without a body, and in a heartbeat the glow dimmed, the form solidifying as the soul transitioned to the purgatory landscape of the land of the dead.\n",
      "If I could have stumbled back in shock, I would have, but I couldn’t even blink in surprise. Not because the soul transitioned—that I expected—but because the ghost now standing in front of me was that of a young woman.\n",
      "My focus shifted from the balding, middle-aged man to the woman who might not have been old enough to drink. Ghosts weren’t like shades. While shades were always an exact representation of the person at the moment of death, ghosts tended to reflect how a person perceived himself. Appearing a little younger or more attractive was common. I supposed it was even possible that if someone identified across gender lines, their ghost might reflect that discrepancy. But this ghost was a drastically different age as well as being a different gender and ethnicity. And that was unheard of.\n",
      "The ghost-girl looked around, no longer inhibited by the spell holding the body she’d been inside. Her dark eyes rounded as her eyebrows flew upward and her motions took on the frantic quickness of panic.\n",
      "A panic that didn’t last long as a figure appeared beside her. He was dressed from head to toe in gray and carrying a silver skull-topped cane. The Gray Man. A soul collector.\n",
      "I wanted to scream No. To run between him and the girl who clearly hadn’t belonged in the dead body. Things didn’t add up here, and I wanted to talk to the ghost.\n",
      "But I still couldn’t move.\n",
      "I stood silently frozen in place as the Gray Man reached out, grabbed the soul, and sent her on to wherever souls went next. Then he turned and looked at the body she’d vacated. His expression gave away nothing as his gaze moved on to me. He gave me one stern shake of his head, which could have meant he didn’t know what was going on or that he knew but it wasn’t any business of mine.\n",
      "Then he vanished.\n",
      "Of course, that was the moment the guard released the spell. I stumbled back as the now truly dead body collapsed.\n",
      "I barely registered the gasps and screams. I only half noted the gun that clattered across the marble as the lifeless body hit the floor. I was far too busy staring at the spot where the Gray Man and the ghost had been. She hadn’t belonged in the wrongly animated body. So how the hell had she gotten into someone else’s body? And why?\n",
      "CHAPTER TWO\n",
      "“You’re saying the man was dead before he ran into the security system?” The cop interviewing me looked up from his notepad, one skeptical eyebrow raised. “And what makes you think that?”\n",
      "“I’m a grave witch. I sensed him when he walked by on the street,” I said, not paying as much attention to the questions as I probably should have been. Most of my attention was focused on the body that someone had draped a black tablecloth over just a few yards away, still where it had collapsed near the door. When I’d first sensed the body—when it was still up and walking around—it had felt like the very recently dead. Now my magic told me it was older, days, maybe even a week, deceased.\n",
      "I squinted, as if the action could reveal more about the body. It didn’t, of course. I could have reached out with my ability to sense the dead, thinned my shields so I gazed across the planes and spanned the chasm between the living and dead, but there was a lot of magic—both latent and active—in the museum, and my shields were already rather worse for the wear after getting caught in the antitheft spell with the corpse.\n",
      "The cop’s eyes narrowed. “So you’re saying you noticed the deceased before he entered, and you followed him in?”\n",
      "“I, uh . . .” Crap. Yeah, I definitely should have been paying more attention to the questions at hand. One look at the cop’s expression told me that I’d just gone from “unlucky witness” to “potential suspect.”\n",
      "The door to the museum swung open and my gaze flicked over the cop’s head. Tamara stepped inside. She held out her laminated medical examiner ID as she assessed the scene, clearly trying to identify who was in charge.\n",
      "“That was fast,” the other officer— the one interviewing the museum curator—said with a look of relief on his face. He wasn’t a homicide detective and he’d responded to a robbery call only to discover a dead body. He likely wanted to hand over his notes and be done with this mess.\n",
      "Tamara shook her head. “I was across the street. At lunch.” The last words held the barest edge, no doubt aimed at me. “I let my office know I was at the scene. The rest of my team should be here soon.” She made her way toward the prone figure. Her baby bump was just barely showing, but her gait had changed slightly. Nothing major, but I’d known her long enough to notice. “Did anyone try to resuscitate the victim?”\n",
      "The cop who’d been questioning me held up one hand, two fingers raised, clearly indicating I shouldn’t go anywhere. He half turned toward Tamara, never letting me out of his sight. Yup, I was officially in his suspect category, and I hadn’t even told him I’d been responsible for driving out the soul who’d hitched a ride in the man’s body.\n",
      "“He was clearly dead when we arrived, ma’am. I checked for vitals, but he was gone.”\n",
      "Tamara nodded absently and reached down to pull the makeshift shroud from the corpse. “What the—?” She jumped backward, dropping the cloth. “Get a magical hazmat team here now. This body needs to be sealed and contained behind a circle. Now.”\n",
      "The cop in front of me radioed in Tamara’s order as his partner began drawing a circle around the corpse. Tamara kept backing away, never turning from the body.\n",
      "I took advantage of the sudden chaos and slipped around the officer so I could get a better look at the body. The shriveled lips had pulled away from the corpse’s teeth, giving him an eerie death grin as his skin had slipped down his face. This wasn’t decay that happened in less than half an hour—this was days of rot. Which corresponded with how long dead my magical senses claimed the man to be.\n",
      "Tamara’s backward stride, steady and slow as if she were afraid that if she turned and ran, the corpse would jump up and give chase, had finally taken her to my side. I knew it wasn’t the decay that had her on edge—I’d seen her happily autopsy bodies in much worse states. No, it was a recent experience she’d had that had nearly killed her and her unborn child. An attack by a body that had transformed after death.\n",
      "She turned to me, her dark eyes wide. “What have you gotten me into now? And why do I hang out with you?” She hissed the question, her voice too fast, too breathy with fear. “You don’t think he is. . . ?”\n",
      "“A ghoul?” I shook my head. “Trust me, I’ll never forget what they feel like. No, this is something different. I don’t know what’s going on, but I definitely don’t like it.”\n"
    ]
  },
  {
    "name": "Once Bitten",
    "firstChapter": [
      "In the last ten minutes I’d gone from miserable to totally screwed.\n",
      "An hour ago I’d thought a city named Haven would be good luck. Now I wondered who it was supposed to be a haven for—polar bears and penguins? Next time I snuck aboard a train, I would remember to check whether it was headed north or south.  The snow-laden streets were the miserable bit; “screwed” began two blocks back when I picked up the scent of something never meant to exist in the human world. Well, a something other than me.\n",
      "A woman cut a beeline through my path, her attention on a curbing taxi. I stopped, the man behind me didn’t.  He shouldered by with a grunt, his briefcase slamming into my thigh. I scowled after him but he didn’t look back, let alone apologize.\n",
      "I hated crowds. Any one of the bundled-up people trudging down the street could be hunting me. Of course, that same anonymity protected me. Shivering inside my over-large coat, I resisted the urge to glance over my shoulder as I matched pace with the pedestrian traffic. Remaining inconspicuous was key.\n",
      "A “Do Not Walk” sign flashed, and the crowd stopped on the corner of Fifth and Harden. Horns blared and drivers shouted, but despite the green light, there wasn’t much room for the cars to move. Some of the more impatient foot traffic wove through the vehicles, earning a one-fingered wave from a cabbie as another car slid into the space that opened in front of him. I debated crossing, but decided keeping a low profile among the suits on the corner was safer. Shifting my weight from foot to foot, I held my breath as a city bus covered us in a dirty cloud of exhaust.\n",
      "A hand landed on my shoulder.\n",
      "“Kita Nekai,” a deep voice whispered. “Come with me.”\n",
      "I froze, unable to turn for fear any movement would betray me into running. Breathe. I needed to breathe, an impossible task around the lump in my throat. My first gasp of air brought the hunter’s scent to me, and the skin along my spine prickled in a response more primal than fear. Damn. Wolf. The blood rushing through my ears drowned out the street sounds so the crowd moved silently, in slow motion.\n",
      "The fingers digging into my shoulder tightened, and my eyes darted to them. The manicured nails and white cuff peeking out under his brown coat sleeve marked the hunter as a suit. He’d blend in nicely with this crowd.\n",
      "“Let go of me.” I didn’t bother whispering, and the woman beside me coughed as she glanced at us.\n",
      "A half-turn put me eye level with the hunter’s red-silk tie. I grabbed his wrist, a weak illusion that I was the one doing the restraining, and cleared my throat.\n",
      "“Thief! Pickpocket! He stole my purse!”\n",
      "People turned, their eyes taking in the hunter’s pristine pinstriped suit and my Salvation Army duster with its patched elbows and frayed hem. The suits closest to us shuffled further away, casting leery glances from the corners of their eyes. But they watched. They all watched, and the hunter couldn’t just drag me off the street with so many human witnesses. I saw that realization burn across his amber eyes.\n",
      "The light changed, and the crowd surged forward, filling the small gap that had opened when I created my scene. The hunter clung to my shoulder, but the push of bodies dislodged his hand, and I let myself be carried away. The businessmen in tailored suits and women in pumps towered over me. I never thought I’d be grateful for being short, but with any luck, that would hide me from the hunter’s view—if only I could cover my scent that easily.\n",
      "The crowd flowed down a set of cement stairs to the subway. The voices of hundreds of commuters bounced off the underground walls, a symphony of impatience accented by flickering florescent tubes. As they pushed into lines in front of the turnstiles, I realized the flaw in this plan: money, or really, my lack thereof.\n",
      "Okay, no time to panic.\n",
      "A weathered sign advertising public restrooms hung on my side of the turnstile, and I hurried through the door. The hunter wasn’t likely polite enough to obey the little girls’ room sign, but I was willing to bet the line of women waiting inside would give him pause.\n",
      "I bypassed the line, ducking inside the first open stall and locking the thin door against the angry murmurs of protest. The cramped space boasted dingy walls covered in scrawled insults and just enough room to stand in front of a rust-rimmed toilet. What a lovely hiding place. The need to pace itched my heels, and I rocked back and forth on my toes, hugging my arms around my chest.\n",
      "Someone pounded on my door.\n",
      "“Stall’s taken,” I said.\n",
      "“Hurry up,” an agitated, but clearly female, voice said.\n",
      "I ignored her. There were two other stalls she could use. \n",
      "I rocked on my heels again. I needed a plan. The bladder-heavy humans aside, if I tried to out-wait the hunter the afterwork crowd would thin, and I needed human observers to protect me. The bathroom had only one door, and if the hunter saw me enter, all he had to do was watch for me to exit. Of course, if I could slip out without him recognizing me . . .\n",
      "How much did he know about me? He knew my name and clan, but did he know anything else? It was a chance I had to take.\n",
      "Balancing on the toilet seat, I tucked my knees to my chest so I wasn’t visible under the stall walls. Around me, agitated voices complained about everything from the wait to the grey weather. I closed my eyes and tuned them out. I needed to center myself. Mentally I stroked the coiled energy inside me. It boiled. Spread. I anticipated the pain but still drew a ragged breath as the energy burst to the surface.\n",
      "A sharp sting shot down my back, and the skin split open. My clothes vanished as they always had for my change. A whimper trembled in my throat, and I choked it back, but it escaped as my skin slipped off and reversed itself. My joints popped loudly as they reformed.\n",
      "Someone banged on my door again. Could they hear the fleshy sound of my muscles and organs rearranging? I hoped they were just impatient. Then I passed into the seconds of the change in which I had no awareness of my surroundings.\n",
      "My skin sealed around my body again, and the dingy stall snapped back into focus. My right foot slipped, and I fell up to my hips into the toilet bowl. Hissing, I scrambled over the seat and landed with a wet plop on the tiled floor.\n",
      "Great, now I resembled a half-drowned rat.\n",
      "Twitching my tail, I shook my back legs and tried to dislodge as much of the water as possible. I only accomplished further soaking the gritty tile. My back paw slipped, leaving grey streaks in its wake across the brown tile.\n",
      "Disgusting.\n",
      "I craned my neck, then hesitated. Did I really want to give my fur a quick bath? That was toilet water. It was better for it to be on my fur than my tongue, right? I struggled with that thought a moment, my instincts demanding the offensive substance be removed.\n",
      " “Anybody in there?” Someone shook the stall door.\n",
      "My attention snapped back to more important matters—time was of the essence, a bath would have to wait. I was taking a risk by shapeshifting into my second form. If the hunter found me, I wouldn’t be able to defend myself—at least not in anyway that would matter, and no one would question him chasing down a cat. But, I had to get out of this subway station.\n",
      "A child pointed as I crawled under the bathroom stall.\n",
      "“Look Mommy, a calico!”\n",
      "I sauntered closer to the girl, staying just out of reach—children had the tendency to pull tails.\n",
      "“Stay away from it,” her mother said, jerking the child back. “It might be rabid.”\n",
      "My lips curled to hiss at the insult, but I curbed the desire. Hostility wouldn’t get me anywhere.\n",
      "Purring, I wound around the legs of the next lady in line. She pressed a tissue to her nose and backed away. Great.\n",
      "Who was my most likely ticket out? My gaze landed on a woman washing her hands. She’d been shopping, and several large department store bags stood staunchly at her feet. Slinking over, I dove into a fancy white bag and curled up beside a hat box and hoped she wouldn’t notice the extra weight.\n",
      "I repositioned myself to balance the load as she claimed her belongings and bustled out of the bathroom. The bag swung in her grip, propelling me into something hard. The turnstile was a nightmare. She pushed through it, and one of the packages squeezed all the air out of me. I thought the worst must be over as the bags swung free again, but the swaying made my stomach threaten to rebel.\n",
      "No, I won’t be sick. I refuse to.\n",
      "I got sick all over her hatbox.\n",
      "Shaking, I eased away from the box. The swish of the train doors opening initiated another barrage of attacks as people crowded into the car. The train lurched into motion, but the movement of the bag settled.\n",
      "I peeked out and found myself at eye level with a startled brunette. She screamed, dumping the contents of her lap to the floor. I guess the cat was out of the bag—well, not yet, but I needed to be. Dashing through a forest of legs, I hid under the seat of a man in mud-caked construction boots.\n",
      "From the limited shelter, I sniffed the recycled, train-car air. Not a hint of the hunter’s scent. \n",
      "Thank the moon.\n",
      "In the past five years I’d caught a hunter’s scent maybe half-a-dozen times. Most cities had at least one hunter stationed somewhere to watch for rogues and strays, but I’d  never before had any reason to believe they were hunting me specifically. This wolf obviously was.\n",
      "Closing my eyes, I mentally touched the tight coil inside me. It would be awhile before I could return to human form. Well, chances were good that the station where I ended up would be far from the hunter. Tucking my tail around my body, I resigned myself to a long ride."
    ]
  },
  {
    "name": "Twice Dead",
    "firstChapter": [
      "I propped my elbows on the balcony rail that hung over the Death’s Angel dance floor. Below me, industrial music pounded against scantily-clad bodies contorting to the beat. A man in a wolf mask and tight pleather pants ground against a girl wearing a tattered red cloak and strategically placed electrical tape. A zombie in more chains than clothes shambled past the couple, headed for a coven of dominatrix witches. Fictional characters and sexualized movie monsters milled everywhere. What most of the clubbers didn’t realize was that among the costumed masses were real monsters—and I was one of them.\n",
      "I glanced at the man beside me. Well, not a man exactly, more like vampire. Nathanial leaned against the wooden balcony rail, his back to the club and dancers. A white opera mask covered half his face, but unlike the famous mask of the fictional phantom, the thin porcelain didn’t cover deformity or ugliness—far from it. Nathanial’s features were as sharp and perfect as if they’d been carved by an artist. They were also currently set in an expression of annoyed arrogance that was as fake as the mask. He’d held that exact expression since we arrived at the club an hour ago.\n",
      "“We showed up. We’ve been seen. Can we go now?” I asked, swirling the contents of my untouched Bloody Mary.\n",
      "“Kita.”\n",
      "My name. Just my name, without any inflection. I took his meaning as ‘No’ or maybe that I already knew the answer. And I did. Tatius, the big bad vampire king of Haven, had summoned us to his little party for a visiting master vamp. So here we were. I balanced the acidic smelling drink on the rail. And here we’ll stay until we’re dismissed.\n",
      "So far, my introduction into eternity as a vampire sucked—and not just blood. Sighing, I shoved the untouched alcohol aside. The bartender, dressed as, shock of all shocks, a vampire—complete with genuine fangs—retrieved the precariously balanced glass before moving on to a customer whose drinking habits required a lower iron content.\n",
      "Without the glass, I had nothing to fidget with, and my attention returned to the writhing bodies on the dance floor. So many people. So many hearts racing and crashing below thin skin. So many heartbeats drowning out the blaring music. Pressure built in the roof of my mouth, turning to pain as my fangs descended.\n",
      "A warm hand landed on my shoulder, and I tore my gaze from the dancers. Nathanial watched me, his fingers sliding from my shoulder, down my arm, to my hand. My knuckles were white where I gripped the balcony rail.\n",
      "I pried my fingers from the wood. Nathanial’s crystal gray gaze flicked to the movement, then back to my mouth.\n",
      "“It’s nothing,” I whispered, trying to keep my lips pressed over my fangs as I spoke.\n",
      "Not that it mattered.\n",
      "“Perhaps we should mingle.” His expression didn’t change. Not a feature twitched, despite the fact I knew he had no interest in talking to anyone in the balcony crowd.\n",
      "The balcony was VIP only. Or really, VIV—Very Important Vampire. Some humans were present, as snacks. Thankfully, I hadn’t noticed any public bloodletting. Yet. But, as vamps didn’t trigger my prey instinct, mingling with them was less likely to result in my accidentally eating someone. On the other hand, it also meant I had to talk to the other vamps—which was way more dangerous, in my opinion.\n",
      "It wasn’t an option I was eager to embrace. “I just need some air.”\n",
      "The edge of Nathanial’s lips tugged downward. A small motion, barely noticeable. It was his first slip all night—and it wasn’t approval. We disagreed on my eating habits, or more accurately, the fact I was subsisting on only animal blood. He was of the opinion that I needed human blood. I was of the opinion that it was his fault I was on a liquid diet in the first place, and he better put up with my sustenance of choice. I sighed, blowing a lock of my tri-colored hair out of my face and intentionally misinterpreting his look.\n",
      "“I know, I know. Vampire. I don’t need to breathe,” I whispered in an exaggerated huff. “But I can’t change twenty-four years of expressions just because I recently woke up slightly less than alive.”\n",
      "Nathanial shook his head, but a smile touched the edge of his mouth. “Walk with me.”\n",
      "His fingers slid through mine and tugged me from the balcony rail. Reluctantly, I followed him into the crowd of vampires.\n",
      "The costumes on this level were more diverse than those on the dance floor below. True masquerade outfits, elegant dresses, velvet top coats, and jewel-encrusted masks made the balcony crowd colorful. But for every Victorian dress or harlequin was a vampire wearing only leather straps across strategic body parts. I couldn’t recognize the native Haven vamps by sight, but considering my previous experience with the local vamps, and the fact Death’s Angel was operated by them, I suspected the visitors weren’t the ones in bondage gear.\n",
      "Nathanial conformed to neither group. His porcelain mask was plain, unadorned, and his black hair hung in a long ponytail trailing down the center of his back, blending with the lush fabric of his opera coat. His costume defined elegance in simple stark black and white.\n",
      "In contrast, my costume was garishly bright. Black and orange tiger stripes decorated my skin-tight unitard. Faux fur rimmed my white gloves and fuzzy white boots. A striped mask completed the outfit. My mess of calico locks—my hair’s natural color and a reminder of what I had been until a couple weeks ago—almost matched the costume. Almost. Nathanial had asked me if I could be anything, what I would be.\n",
      "I glared at the stripes. Tiger stripes. Like my father’s. Me and my big mouth.\n",
      "“Hermit, it has been a long time,” a male voice said. I cringed. Only vamps called Nathanial ‘Hermit.’ Nathanial turned toward the voice, moving me with him, and Ilooked up, and then up some more. The speaker towered over us, and while I was on the short side, Nathanial wasn’t. The man wore a fitted crushed velvet maroon frock coat I could have used as a dress. Falls of lace escaped from his cuffs and collar, and a gold mask set with rubies obscured wide features. He was so massive, it took me a moment to notice the small woman at his side. She was his exact opposite. Where he was all blunt edges she was sharp, petite. She was my height, but beside him she looked like a fragile doll in her frilled dress and silver mask.\n",
      "“Three hundred years, I believe, Traveler,” Nathanial said, his voice polite but disinterested.\n",
      "“At least.” The giant’s gaze moved from Nathanial to me and then back. “A lot has changed in that time.”\n",
      "I groaned silently—or perhaps not all that silently, as all eyes moved to me. Oops. Still, I didn’t want to listen as they hashed out three hundred years of vampire history as small talk. I glanced around. There was an empty spot on a couch in the far corner of the balcony. “I think I’ll just . . . ” I pointed at the couch. Nathanial’s eyes frowned at me. Not his mouth, or his expression,\n",
      "I’d just come to know those eyes, to know him, well enough over the last few weeks to see the fact he didn’t think it was a good idea.\n",
      "“It’s just right there,” I said, backing away as I spoke.\n",
      "He didn’t stop me, so I turned tail, all but running for the sanctuary of the couch.\n",
      "Most of the seating on the balcony was filled—vamps tended to sprawl, but the couch I claimed had only one other person sitting rigidly at the other end. She wore a simple, black–and-white, harlequin jumper with an elaborate, full-faced mask, a large feathered hat, and brown curls that looked so synthetic they had to be a wig.\n",
      "She didn’t move as I collapsed onto the far cushion, and I let out a relieved breath. At least I won’t be expected to socialize. I refilled my lungs—the habits of the living die hard—and that was a mistake.\n",
      "The cloying scent of blood rolled over my tongue, caught in the back of my throat, filled my senses. The scent was cold, bitter, not all that appetizing, but it was very close and thus, tempting. Oh, so close. My fangs burst free in a flash of hunger, and I slid across the cushion without consciously deciding to move.\n",
      "The woman didn’t react or look up as I sidled up next to her. There was something off about the scent of her blood. But that didn’t matter. Not right now. All that mattered was the smell of it.\n",
      "My fingers brushed her shoulder. The mask tumbled forward. The hat and wig followed, the wig's synthetic curls flying.\n",
      "I jumped to my feet. Above the frill of her collar was a stubby, raw neck. No head.\n",
      "A fake mannequin head plunked against the floor. Rolled. It stopped finally, settling three feet from the couch. I backed away, aware of the heavy silence suddenly coalescing on the balcony. Industrial music still pounded below me, but the vampires had gone deadly still.\n",
      "A large hand closed around my arm. The grip tight. Painful.\n",
      "“What did you do?” A rough voice whispered the question behind my ear.\n",
      "“I, uh . . . ” I gulped and made a wild, floundering motion from the head to the body. “Her head just fell off?”\n",
      "A woman in a gold-trimmed gown stepped forward and knelt to study the fake head. Un-seeing glass eyes stared out of it. As if all tied to one string, every vampire in the room shifted their gaze from the head, to me, and then to the body, which was still perched primly on the couch. Her hands were in her lap, one gripping a glass balanced on her thigh, but she was definitely not a mannequin. The smell of blood aside, I could see the white of her exposed spine among the pinker flesh of her throat.\n",
      "“What is the meaning of this?” demanded the woman in the gold trimmed gown. “Where is her head?”\n",
      "I thought, at first, that the woman was asking me. As if I had any idea. Then I realized her glare went over my shoulder, to the man still gripping my arm. I glanced back, but didn’t recognize the vamp holding me. Based on the leather pants loaded with silver studded straps, and the electric blue hair that fell to his chin in jagged tapered tips, I guessed he was one of the local vamps. Then I noticed his eyes: green and old, with a gaze that landed like a physical weight on my skin.\n",
      "Tatius.\n",
      "I swallowed hard. Oh crap, a decapitated body and the attention of the king of Haven. Did I know how to break up a party or what?\n",
      "Chapter Two\n",
      "“What happened?” Tatius demanded, his glare boring into me.\n",
      "I looked around. Nathanial was several feet away, standing at the edge of the semi-circle that had opened around me. His posture was aloof, uninterested, but he watched me without blinking. He tapped two long fingers on his full bottom lip, as if idly contemplating an obscure thought, but again, his gaze didn’t waver. Something about my mouth? I pressed my lips together.\n",
      "Crap. My fangs were still out.\n",
      "I willed the damn things to retract, and Tatius’s grip on my arm tightened. He shook me.\n",
      "“I said, what happened?” “I touched her shoulder, that was all.” “Should we guess why?” A chime-like voice spoke from\n",
      "somewhere in the mass of vampires. I gritted my teeth and resisted the urge to press my hand over my\n",
      "mouth. My fangs weren’t visible anymore, I knew that, but it was no great mystery to anyone on the balcony what had been motivating me. “She smelled like blood,” I muttered under my breath.\n",
      "I should have known better. Vampire hearing was exquisite.\n",
      "The woman in the gold-trimmed dress lifted an arched eyebrow dotted with rhinestones. “In this crowd, I should think more than a reckless child”—she dismissed me with the insult—“would have noticed blood. Unless there was some trick involved.” She stared at the posed figure again. There was no blood on the collar of the outfit— there wasn’t even blood around the cleanly severed stub of neck. The woman turned back to Tatius. “What have you to say of this, Puppet Master?”\n",
      "“My apologies, Collector. I assure you, I intend to get to the bottom of it.” Tatius’s gruff voice crackled down my back.\n",
      "Collector? Great. The Collector was the big bad star of this party. The guest of honor. I so needed to get out of here. In my old life I’d learned better than to pull an alpha cat’s tail—though knowing better didn’t mean it didn’t happen anyway, sometimes. But I totally hadn’t meant to land in the center of this attention. “Nuri,” Tatius said, turning toward the crowd. The mass of vampires who—now that the initial shock of the body’s discovery had worn off—were murmuring among themselves, parted to allow a pre- teen girl through.\n",
      "As the girl, Nuri, approached, Tatius released my arm. Thank the moon. I moved to step aside, but his hand slid around the back of my neck. The touch wasn’t restraining, but it was overly personal, his fingers coming to a rest in the hollow between my collarbone and throat. Oh hell no. The last time I met Tatius, he’d considered killing me. Then he’d forced his blood in me. I did not want anything else to do with the vamp.\n",
      "I tried to shrug him away, but his fingers flexed in response, his nails biting against my skin. Okay, so apparently I was going to have to make a scene—another scene—or stay put. I erred on the side of caution, for once.\n",
      "Nuri, dressed as an ancient Egyptian queen with a large snake peeking out beneath her dark dreadlocks, knelt beside the harlequin. As I watched her lift the dead woman’s hand, I realized where I’d seen Nuri before. She’d sat at the council table the first time I was brought before the vampires, which meant she must be a lot older than she looked.\n",
      "After a moment of poking at the body, she stood and turned to Tatius. “Rigor mortis has only begun to set, so I’d guess she’s been dead no more than four hours. There is no tearing of the flesh, so she was decapitated by a sharp instrument. The lack of blood suggests she was drained before death. I’ll report more when I find it.” The words were too old, too serious for her thin, girlish voice. Not that anyone else appeared to notice. She stepped aside and nodded to two pleather- clad vampires, who rushed forward to lift the body and carry it toward a private elevator in the corner. The fake head still lay on the floor, ignored.\n",
      "The Collector stepped forward, over the forgotten head, until the train of her dress engulfed it. “You have your Truthseeker looking into things, and while I’m sure she will be very thorough”—the way she said it made it clear she was not certain of any such thing—“I offer the assistance of one of my vampires.” Without waiting for an answer, she lifted her hand. “Elizabeth, attend us.”\n",
      "Tatius’s fingers flexed against my skin. Agitation? Anger? But he didn’t say anything as the small, doll-like woman I’d seen earlier in the night on the giant’s arm stepped forward. “I will be happy to assist,” the woman said, curtsying to the\n",
      "Collector. Then she turned and her icy eyes caught on mine. “At least we know the harlequin wasn’t this fledgling’s snack.”\n",
      "Tatius’s fingers flexed again, harder this time. “Hermit, find her someone to eat.” He shoved me toward Nathanial, and I gladly retreated from the center of attention.\n",
      "Nathanial’s arm slipped around my waist as I reached him, and he wove us through the crowd, away from the couches. We passed the two vampires waiting for the elevator with the body, and I breathed deeply, rolling the decapitated woman’s scent through my senses. The sweet tang of blood reached for me, made the roof of my mouth burn, but I focused on committing her scent to memory.\n",
      "Nathanial didn’t fail to notice my signs of hunger. “I am taking you home.”\n",
      "Home. It was a nice thought. I’d had enough with vampires. Enough of their double-tongued political games. And enough headless bodies. But . . .\n",
      "I glanced back at the vamps loading the corpse into the elevator, but it wasn’t her harlequin costume I saw. My mind replaced her with the image of another body, one bloated from several days of death. A human body that had been, in part, my fault, because I’d accidentally created the shifter who’d killed her. I’d tracked the murderer, stopped him, but the weight of his victims wore on me.\n",
      "Nathanial studied me with eyes that saw too much. Eyes that stripped away my secrets. He shook his head, a small smile tipping the edge of his lips. It wasn’t a happy smile. I looked away, and he drew me closer to the side of his body without breaking stride toward the stairs.\n",
      "“I will take you to the hospital,” he said. “You can visit them.”\n",
      "Two weeks ago, I would have avoided hospitals at all costs. But then, two weeks ago, I’d still had to breathe to live, I’d spent most of my time as a six-pound calico kitten, and I hadn’t yet known I’d created a rogue who’d gone on a killing spree. A rogue whose victim count totaled fourteen women.\n",
      "The only two survivors were currently in medically-induced comas at Saint Mary’s Hospital. Two weeks ago it would have been easier to walk away from a headless body. To trust that someone else would deal with it. A lot can change in two weeks.\n",
      "I glanced back at the gathered vampires. All the vampires in Haven were on this balcony. The harlequin had been drained of blood. If the killer was a vampire, he was here. It has nothing to do with me. This murder isn’t my responsibility. It isn’t.\n",
      "I let Nathanial lead me out of the club. But damn, guilt was a bitch.\n",
      "***\n",
      "Two hours later, I walked into Nathanial’s kitchen. Without Nathanial. After all, we hadn’t been formally dismissed by Tatius, so he had to return to Death’s Angel after our visit to the hospital. I was still flushed from the flight home as I followed the sounds of the television into the front den. Even after dozens of airborne trips with Nathanial, I still couldn’t get enough of the wind in my face and watching the world slip by below us. I could only hope the ability to fly would be a vampire trick I’d learn one day.\n",
      "I pushed open the den door. “You up for a hunt?”\n",
      "Bobby, a shifter from my home world of Firth, and once the big love of my life, was currently a couch-crasher in Nathanial’s cabin and would continue to be until the gate to Firth reopened and he could return to his pregnant mate. He looked up as I entered. Our relationship was complicated, and awkward, but we were working it out. Mostly. When he wasn’t threatening to drag me back to Firth with him, that is.\n",
      "He hit a button on the remote, muting the brightly animated cartoon on the screen. Then he lifted his feet from the arm of the couch. I slid into the free spot.\n",
      "“So, hunting?”\n",
      "“Still hungry? We caught dinner before you left.” He frowned, his brow creasing, and he rolled to a sitting position. “Did something happen at that vamp club?”\n",
      "“It, no, well . . . ” I grabbed one of the hunter green throw pillows and dragged it into my lap. “I’m just hungry.”\n",
      "Bobby slid closer, moving into my personal space. “You’re starting to smell like a frightened rabbit.”\n",
      "Okay, this was what I meant by awkward. I jumped to my feet. “I’ll just go by myself.” “Kitten . . . ” “Forget I asked.” I headed for the door. Bobby was right. We’d already hunted tonight. Even with the heightened metabolism of a shapeshifter, Bobby was only one person and his other form was a bobcat—he didn’t need two rabbits in one night. Hell, in Firth, he wouldn’t have eaten more than three or four rabbits a week. It was wasteful to kill more tonight.\n",
      "He caught up with me at the front door and pulled his sweater off despite the blanket of snow spreading out around the cabin. He had to shift if he intended to hunt.\n",
      "I took the front steps two at a time. “I said to forget it.”\n",
      "He jutted his chin and continued to disrobe. “We’ll freeze the extra meat.” His fingers moved to the button of his jeans. “You hunting like that?”\n",
      "I glanced down. I was still wearing the ridiculous tiger suit, but unlike Bobby, my clothes didn’t matter. He’d lose a lot of mass once he shifted, and a thirty-pound bobcat couldn’t exactly wear a two- hundred-pound man’s jeans and sweater. Technically, whenever I shifted, my clothing disappeared. That was my gift. Or it had been, before I became a vampire. Now I was stuck in one form. My claws had extended, once, when I’d been in a fight for my life against the rogues. But since then, my cat had remained locked in the cold coil inside me. Dead.\n",
      "I kicked off my party boots. “Let’s hunt.”\n",
      "***\n",
      "Snow crunched under my bare toes, and my prey lifted its head, its long ears twitching. I went still, not even daring to breathe. Beside me, Bobby hesitated, his compact bobcat form disappearing behind a frozen shrub.\n",
      "The snow hare’s ears twitched again, his whiskers trembling as his nose worked. Muscles bunched as he prepared to leap, and I sprang into motion.\n",
      "Brittle, ice-encased twigs shattered as I broke through the frozen brush. My dash was noisy, but that didn’t matter now. Not at the speed I was moving. I pounced, snatching the hare in mid-bound.\n",
      "It screamed, a piercing distress call. I grabbed at its pumping back legs, but one slipped away. Pain flared across my collarbone as the hare’s back claws ripped through the thin material of my costume, tearing into the skin below. Not that the pain stopped me. I caught the leg with one hand, gripping the hare’s scruff with the other, and effectively immobilized it. Fur brushed my lips, then my fangs sank into the back of its neck. Liquid warmth filled my mouth, slid down my throat. Heat, life, filled my torso, spreading contentment toward my limbs.\n",
      "Then the hare’s mind opened to me.\n",
      "Panic raked across my senses, stabbing deep. Run, the hare’s instincts urged me. Every cell in my body knew I’d die if I couldn’t run. My heart jumped to my throat, making swallowing difficult.\n",
      "A vampire bite caused euphoria in humans, but animals recognized death when it caught them. Still, even as the depths of the hare’s fear enfolded me, I had other instincts—darker, more demanding needs which kept my mouth working, my throat convulsing.\n",
      "The small hare drew one last breath. Then the connection between our minds snapped. The sudden absence of its terrified presence left a gaping hole in my mind—an emptiness which didn’t fill as I regained awareness of myself and of the limp body in my fingers.\n",
      "My hands trembled as I set the small corpse in front of Bobby. I swallowed hard. My tongue tasted like I’d been sucking on an old piece of copper, and I shivered despite the new warmth rushing through my limbs. This is natural. The way it should be. I’d been born a predator. A cat. I’d hunted with my clan all my life. This hare was prey, serving its function in the circle of life.\n",
      "Bobby butted my knee with his tawny, bobcat head, his imploring, almond-shaped eyes watching me. My gaze refocused, and I realized I was still crouched over the dead hare, my thumb sliding along its cooling paw. I pulled my hand away and lunged to my feet.\n",
      "Bobby stared at me a heartbeat or two longer. Then his paw lashed out, fast and precise, disemboweling the hare. The animal version of field dressing—or an appetizer. A scream sounded in my head again, starting as the dead rabbit’s voice, then bleeding into a woman’s sobbing cry. I turned away, but it was too late.\n",
      "Finding the beheaded body earlier tonight had been too much of a reminder of the rogues’ actions. Now, in my mind’s eye, I saw claws rip through flesh. The flesh was furless, pale, human, and very much alive. The woman’s scream redoubled in pain, and giddy amusement bubbled in me as I reached out to rip away more tender skin.\n",
      "No, I won’t see this—won’t feel it. Not again.\n",
      "I squeezed my eyes shut, but I couldn’t block out images playing behind my eyelids. Bobby’s feline call of concern grew distant; the first clue that I was running. My stride carried me effortlessly through the frozen forest, but I couldn’t distance myself from the memories haunting me.\n",
      "And memories they were. They just weren’t mine. I’d absorbed the memories when I’d tried to drain the rogue during our fight. My mind had touched his, had seen through his eyes, had felt the high that rushed through him when he killed. Now I had flashbacks that put me in a front-row seat to the sense-surround biography of a sociopath. And those tainted thoughts I’d never be able to outrun.\n",
      "Chapter Three\n",
      "Running did little to clear my head, and I eventually forced myself to slow. Sticky blood seeped down the front of my costume from the hare’s deep scratch on my shoulder. I probably ruined the costume. At least I’ll never have to wear it again. Circling back to the cabin, I brushed the snow clinging to my bare feet on the welcome mat before stepping inside.\n",
      "“Bobby? Nathanial? Anyone here?” I called as I pushed the front door closed behind me.\n",
      "No one answered, but footfalls thudded in the hall—footfalls far too heavy to belong to a bobcat. I cringed as the double doors swung open and Nathanial’s Newfoundland trudged into the kitchen.\n",
      "“Sit, Regan.”\n",
      "The massive dog just cocked his head. He rounded the large table that monopolized the room, his black nose working as he approached. I pressed my back flat against the wall, my hand groping for the door knob.\n",
      "“Regan, stay.” I peeled my free hand off the wall and tried to mimic the gesture Nathanial used to control the beast.\n",
      "Regan didn’t pay attention.\n",
      "He took another step forward. Phantom pain laced through my torso, tracing the path of old scars from an attack I’d barely survived as a child. The attack had been by a rogue wolf, not a dog, but dogs were still Canids, and close enough to wolves to make me uneasy.\n",
      "The dog sniffed the air, his large muzzle lifting, and I shuffled sideways. Okay, maybe more than just “uneasy.”\n",
      "Regan stopped, his floppy ears pricking like he heard something. Then his head swung to the door and his ears dropped, his hackles rising.\n",
      "“Niiice doggy,” I whispered.\n",
      "Regan’s lip rolled back in a silent growl, but he wasn’t looking at me. His gaze was fixed on the door. A loud ding dong sliced through the air.\n",
      "I jumped. The doorbell? I hadn’t even known Nathanial had a doorbell. And who would visit out here in the middle of nowhere? The bell dinged again. “Let us in, little one,” a deep female voice called, the words heavily accented by a throat clearly more accustomed to pronouncing a harsher Germanic language.\n",
      "Oh, this evening kept getting better and better. I knew that voice. It belonged to the vampire council’s enforcer, Anaya. And I was willing to bet, even though I couldn’t hear him, that her companion Clive was with her. I’d only met the pair of enforcers once before, but they’d gleefully delivered me to what they had believed would be my final death. I didn’t foresee us becoming friends.\n",
      "“You’ll have to come back later. Nathanial isn’t here.”\n",
      "“Open the door.” This time the voice was clipped and masculine. Definitely Clive.\n",
      "Regan apparently didn’t appreciate the vampire’s tone either, because his silent growl became increasingly less silent.\n",
      "My fists clenched at the growl, my fangs descending. He’s not growling at you, I reminded myself, repeating it like a mantra in my mind. The mantra didn’t help. A great, growling dog was between me and the door. He could have it.\n",
      "I scuttled further away, sliding along the kitchen wall. Regan fell silent, and if I hadn’t been listening so hard, I wouldn’t have heard the creak of the wooden stairs outside.\n",
      "Anaya and Clive were leaving? Just like that?\n",
      "Regan looked at me, his mouth falling open and his pink tongue lolling out one side. It was a happy expression, I knew it was, but I still shivered at the sight of all his big, white teeth.\n",
      "“Uh, why don’t you stay here in the kitchen, and I’ll go somewhere else?” I asked the big dog.\n",
      "He regarded me with shiny black eyes, and then plopped down on the tile.\n",
      "I’ll take that as yes.\n",
      "Pushing off the wall, I crept across the room, angling for the swinging doors in the opposite corner. Regan watched every halting step. I was a yard beyond him when a loud bang crashed against the door.\n",
      "I leapt backward, slamming into the huge table. Regan also jumped to his feet, his hackles lifting, his long fur fluffing out like an excited porcupine.\n",
      "“I think you lost something,” Anaya called through the door. She punctuated the statement with the sound of something hard hitting something meaty.\n",
      "A pained grunt drifted through the door. I’d lost something that could be hurt?\n",
      "Oh no.\n",
      "Bobby.\n",
      "Forgetting about the growling dog, I darted across the room and flung open the door. Anaya stood directly in front of the door, still dressed in the costume she must have been wearing at the party earlier—unless she normally dressed as an eighteenth century bar wench with a skirt far too short for the time period. Behind her, Clive was dressed as Napoleon—appropriate, given his height—but instead of hiding his right hand in his uniform, he gripped Bobby’s once again human wrists. Clive’s other hand curled in Bobby’s shoulder-length tawny hair, controlling Bobby’s head, pulling it back to expose his naked throat."
    ]
  }
]
